<?xml version="1.0" encoding="utf-8"?>
<feed xmlns="http://www.w3.org/2005/Atom">
  <title>InfinityMiao&#39;s Blog</title>
  <icon>https://www.gravatar.com/avatar/1b1b318096be8f4f173447e00f65ea0b</icon>
  
  <link href="/atom.xml" rel="self"/>
  
  <link href="http://infinitymiao.cn/"/>
  <updated>2019-11-19T01:32:24.380Z</updated>
  <id>http://infinitymiao.cn/</id>
  
  <author>
    <name>InfinityMiao</name>
    <email>524937890@qq.com</email>
  </author>
  
  <generator uri="http://hexo.io/">Hexo</generator>
  
  <entry>
    <title>learned index学习笔记</title>
    <link href="http://infinitymiao.cn/2019/11/12/learned-index%E5%AD%A6%E4%B9%A0%E7%AC%94%E8%AE%B0/"/>
    <id>http://infinitymiao.cn/2019/11/12/learned-index学习笔记/</id>
    <published>2019-11-12T01:42:27.971Z</published>
    <updated>2019-11-19T01:32:24.380Z</updated>
    
    <content type="html"><![CDATA[<p>&#x8BBA;&#x6587;&#x94FE;&#x63A5;&#xFF1A;<a href="https://www.researchgate.net/publication/321512926_The_Case_for_Learned_Index_Structures" target="_blank" rel="noopener">https://www.researchgate.net/publication/321512926_The_Case_for_Learned_Index_Structures</a></p><h2 id="&#x524D;&#x8A00;"><a href="#&#x524D;&#x8A00;" class="headerlink" title="&#x524D;&#x8A00;"></a>&#x524D;&#x8A00;</h2><p>&#x6570;&#x636E;&#x5E93;&#x7684;&#x7D22;&#x5F15;&#x548C;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x91CC;&#x7684;&#x9884;&#x6D4B;&#x6A21;&#x578B;&#x5176;&#x5B9E;&#x6709;&#x4E00;&#x4E9B;&#x76F8;&#x4F3C;&#x4E4B;&#x5904;&#xFF0C;&#x6BD4;&#x5982; B &#x6811;&#x662F;&#x628A; key &#x6620;&#x5C04;&#x5230;&#x4E00;&#x4E2A;&#x6709;&#x5E8F;&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x67D0;&#x4E2A;&#x4F4D;&#x7F6E;&#xFF0C;Hash &#x7D22;&#x5F15;&#x662F;&#x628A; key &#x6620;&#x5C04;&#x5230;&#x4E00;&#x4E2A;&#x65E0;&#x5E8F;&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x67D0;&#x4E2A;&#x4F4D;&#x7F6E;&#xFF0C;bitmap &#x662F;&#x628A; key &#x6620;&#x5C04;&#x6210;&#x662F;&#x4E00;&#x4E2A;&#x5E03;&#x5C14;&#x503C;&#xFF08;&#x5B58;&#x5728;&#x4E0E;&#x5426;&#xFF09;&#x3002;</p><p>&#x6240;&#x4EE5;&#x8FD9;&#x5C31;&#x662F;&#x672C;&#x6587;&#x8981;&#x8BA8;&#x8BBA;&#x7684;&#x5730;&#x65B9;&#x4E86;&#xFF0C;&#x4EE5;&#x4E0A;&#x7684;&#x60F3;&#x6CD5;&#x662F;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x7684;&#x3002;&#x5B9E;&#x9A8C;&#x8868;&#x660E;&#xFF0C;&#x5728;&#x67D0;&#x4E9B;&#x6570;&#x636E;&#x96C6;&#x4E0A;&#xFF08;&#x6709;&#x89C4;&#x5F8B;&#x53EF;&#x5FAA;&#x7684;&#x6570;&#x636E;&#x96C6;&#xFF09;&#xFF0C;&#x7528; RM-Index &#x9884;&#x6D4B;&#x6A21;&#x578B;&#x4EE3;&#x66FF; B &#x6811;&#x4E4B;&#x7C7B;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x53EF;&#x4EE5;&#x63D0;&#x5347; 70% &#x7684;&#x901F;&#x5EA6;&#x3001;&#x5E76;&#x8282;&#x7EA6;&#x76F8;&#x5F53;&#x53EF;&#x89C2;&#x7684;&#x7A7A;&#x95F4;&#x3002;</p><p>&#x4F8B;&#x5982;&#x5C06; index &#x89C6;&#x4F5C;&#x6A21;&#x578B;&#x7684;&#x65F6;&#x5019;&#xFF0C;key &#x4F5C;&#x4E3A;&#x8F93;&#x5165;&#xFF0C;&#x5BF9;&#x5E94; key &#x7684;&#x8BB0;&#x5F55;&#x7684; position &#x4F5C;&#x4E3A;&#x9884;&#x6D4B;&#x7ED3;&#x679C;&#x3002;</p><h2 id="Range-Index-&#x6A21;&#x578B;&#x62BD;&#x8C61;&#x4E3A;-CDF"><a href="#Range-Index-&#x6A21;&#x578B;&#x62BD;&#x8C61;&#x4E3A;-CDF" class="headerlink" title="Range Index &#x6A21;&#x578B;&#x62BD;&#x8C61;&#x4E3A; CDF"></a>Range Index &#x6A21;&#x578B;&#x62BD;&#x8C61;&#x4E3A; CDF</h2><p>&#x5BF9;&#x4E8E;&#x533A;&#x95F4;&#x67E5;&#x8BE2;&#x800C;&#x8A00;&#xFF0C;&#x6570;&#x636E;&#x5FC5;&#x987B;&#x662F;&#x6709;&#x5E8F;&#x7684;&#xFF0C;&#x8FD9;&#x6837;&#x624D;&#x80FD;&#x6709;&#x6548;&#x7684;&#x67E5;&#x5230;&#x5BF9;&#x5E94;&#x7684;&#x8BB0;&#x5F55;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x8BDD;&#x6211;&#x4EEC;&#x5C31;&#x89C2;&#x5BDF;&#x5230;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x6709;&#x8DA3;&#x7684;&#x73B0;&#x8C61;&#xFF0C;&#x9884;&#x6D4B;&#x7ED9;&#x5B9A;&#x6709;&#x5E8F;&#x7684;&#x6570;&#x7EC4;&#x5185; key &#x7684; position &#x8FD1;&#x4F3C;&#x7D2F;&#x8BA1;&#x5206;&#x5E03;&#x51FD;&#x6570;&#xFF08;CDF&#xFF09;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5EFA;&#x6A21;&#x6570;&#x636E;&#x7684; CDF &#x6765;&#x9884;&#x6D4B;&#x6570;&#x636E;&#x7684; position&#x3002;</p><p>&#x4F5C;&#x8005;&#x5C1D;&#x8BD5;&#x4F7F;&#x7528; 200 M &#x7684; web &#x670D;&#x52A1;&#x65E5;&#x5FD7;&#x8BB0;&#x5F55;&#x4E2D;&#x7684;&#x65F6;&#x95F4;&#x6233;&#x4F5C;&#x4E3A;&#x6570;&#x636E;&#x96C6;&#x6765;&#x8BAD;&#x7EC3;&#x6A21;&#x578B;&#xFF0C;2&#x5C42;&#x5BBD;&#x5EA6;&#x4E3A;32&#x7684;&#x5168;&#x8FDE;&#x63A5;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4F7F;&#x7528; ReLU &#x4F5C;&#x4E3A;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;&#xFF0C;&#x65F6;&#x95F4;&#x6233;&#x4F5C;&#x4E3A;&#x8F93;&#x5165;&#xFF0C;position &#x4F5C;&#x4E3A; label&#xFF0C;&#x4F7F;&#x7528; TensorFlow &#x548C; Python &#x8FDB;&#x884C;&#x6A21;&#x578B;&#x8BAD;&#x7EC3;&#xFF0C;&#x5927;&#x7EA6;&#x9700;&#x8981;&#x82B1;&#x8D39; 80000 &#x7EB3;&#x79D2;&#x8FDB;&#x884C;&#x6A21;&#x578B;&#x7684;&#x8BAD;&#x7EC3;&#xFF0C;&#x67E5;&#x8BE2;&#x51E0;&#x4E4E;&#x4E0D;&#x82B1;&#x8D39;&#x65F6;&#x95F4;&#xFF0C;&#x4F5C;&#x4E3A;&#x5BF9;&#x6BD4;&#xFF0C;B &#x6811;&#x67E5;&#x627E;&#x540C;&#x6837;&#x7684;&#x6570;&#x636E;&#x5927;&#x7EA6;&#x53EA;&#x9700;&#x8981; 300 &#x7EB3;&#x79D2;&#xFF0C;&#x76F8;&#x5DEE;&#x4E24;&#x4E2A;&#x6570;&#x91CF;&#x7EA7;&#xFF0C;&#x6574;&#x4E2A; key &#x7A7A;&#x95F4;&#x67E5;&#x627E;&#x5927;&#x7EA6;&#x5FEB;2-3&#x500D;&#xFF0C;&#x53EF;&#x80FD;&#x662F;&#x7531;&#x4EE5;&#x4E0B;&#x539F;&#x56E0;&#x5BFC;&#x81F4;&#x7684;&#x3002;</p><ol><li>TensorFlow &#x66F4;&#x9002;&#x7528;&#x4E8E;&#x5927;&#x7684;&#x6A21;&#x578B;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x4F7F;&#x7528; Python &#x4F5C;&#x4E3A;&#x524D;&#x7AEF;</li><li>&#x6700;&#x540E;&#x4E00;&#x516C;&#x91CC;&#x7684;&#x7CBE;&#x5EA6;&#x95EE;&#x9898;&#xFF0C;&#x867D;&#x7136;&#x6574;&#x4F53;&#x6570;&#x636E;&#x5206;&#x5E03;&#x770B;&#x4E0A;&#x53BB;&#x63A5;&#x8FD1;&#x4E8E; CDF&#xFF0C;&#x5F88;&#x5E73;&#x6ED1;&#xFF0C;&#x4F46;&#x662F;&#x653E;&#x5927;&#x67D0;&#x4E2A;&#x70B9;&#x7684;&#x6570;&#x636E;&#x5206;&#x5E03;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x53D1;&#x73B0;&#x6570;&#x636E;&#x5206;&#x5E03;&#x5F88;&#x4E0D;&#x89C4;&#x5219;&#xFF0C;&#x6240;&#x4EE5;&#x5982;&#x4F55;&#x89E3;&#x51B3;&#x6700;&#x540E;&#x4E00;&#x516C;&#x91CC;&#x7684;&#x7CBE;&#x5EA6;&#x95EE;&#x9898;&#x5C31;&#x5341;&#x5206;&#x91CD;&#x8981;</li><li>&#x7ECF;&#x5178;&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x95EE;&#x9898;&#xFF0C;&#x6700;&#x7EC8;&#x7684;&#x76EE;&#x6807;&#x662F;&#x60F3;&#x8981;&#x51CF;&#x5C0F;&#x5E73;&#x5747;&#x8BEF;&#x5DEE;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x67E5;&#x627E;&#x7D22;&#x5F15;&#xFF0C;&#x662F;&#x5E0C;&#x671B;&#x83B7;&#x5F97;&#x6700;&#x4F73;&#x9884;&#x6D4B;&#xFF0C;&#x6700;&#x7EC8;&#x662F;&#x671F;&#x671B;&#x627E;&#x5230; key &#x7684;&#x771F;&#x5B9E;&#x7684; position</li><li>B+ &#x6811;&#x5341;&#x5206;&#x9AD8;&#x6548;&#xFF0C;&#x56E0;&#x4E3A;&#x9876;&#x5C42;&#x7684;&#x8282;&#x70B9;&#x4E5F;&#x5C31;&#x662F;&#x7D22;&#x5F15;&#x90FD;&#x5728;&#x7F13;&#x5B58;&#x4E2D;&#xFF0C;&#x4F46;&#x662F;&#x5176;&#x4ED6;&#x6A21;&#x578B;&#x65E0;&#x6CD5;&#x5229;&#x7528;&#x7F13;&#x5B58;&#x7684;&#x9AD8;&#x6548;&#x6027;&#xFF0C;&#x6BD4;&#x5982;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x90A3;&#x4E48;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x6240;&#x6709;&#x7684;&#x6743;&#x91CD;&#x6765;&#x9884;&#x6D4B;&#x6700;&#x7EC8;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x6743;&#x91CD;&#x5982;&#x679C;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x8BDD;&#x5F00;&#x9500;&#x5C31;&#x4F1A;&#x6BD4;&#x8F83;&#x5927;</li></ol><h2 id="&#x8303;&#x56F4;&#x7D22;&#x5F15;"><a href="#&#x8303;&#x56F4;&#x7D22;&#x5F15;" class="headerlink" title="&#x8303;&#x56F4;&#x7D22;&#x5F15;"></a>&#x8303;&#x56F4;&#x7D22;&#x5F15;</h2><p>&#x4E3A;&#x4E86;&#x89E3;&#x51B3; ML &#x6A21;&#x578B;&#x66FF;&#x4EE3; B+ &#x6811;&#x7684;&#x6700;&#x540E;&#x4E00;&#x516C;&#x91CC;&#x7CBE;&#x5EA6;&#x95EE;&#x9898;&#xFF0C;paper &#x4E2D;&#x63D0;&#x51FA;&#x4E86; LIF &#xFF08;Learning Index Framework&#xFF09;&#x548C;&#x9012;&#x5F52;&#x6A21;&#x578B;&#x7D22;&#x5F15;&#xFF08;RM-Index&#xFF09;&#xFF0C;&#x4E3B;&#x8981;&#x4F7F;&#x7528;&#x7B80;&#x5355;&#x7684;&#x5168;&#x8FDE;&#x63A5;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x3002;</p><h3 id="The-Learning-Index-Framework"><a href="#The-Learning-Index-Framework" class="headerlink" title="The Learning Index Framework"></a>The Learning Index Framework</h3><p>LIF &#x53EF;&#x4EE5;&#x770B;&#x505A;&#x4E00;&#x4E2A;&#x7D22;&#x5F15;&#x7EFC;&#x5408;&#x7CFB;&#x7EDF;&#xFF0C;&#x7ED9;&#x5B9A;&#x4E00;&#x4E2A;&#x7D22;&#x5F15;&#x89C4;&#x8303;&#xFF0C;LIF &#x53EF;&#x4EE5;&#x751F;&#x6210;&#x4E0D;&#x540C;&#x7684;&#x7D22;&#x5F15;&#x914D;&#x7F6E;&#xFF0C;&#x4F18;&#x5316;&#x5E76;&#x4E14;&#x81EA;&#x52A8;&#x6D4B;&#x8BD5;&#xFF0C;&#x53EF;&#x4EE5;&#x5373;&#x65F6;&#x7684;&#x5B66;&#x4E60;&#x7B80;&#x5355;&#x7684;&#x6A21;&#x578B;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x4F9D;&#x8D56; TensorFlow &#x83B7;&#x53D6;&#x590D;&#x6742;&#x7684;&#x6A21;&#x578B;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x4F7F;&#x7528; TensorFlow &#x8FDB;&#x884C;&#x9884;&#x6D4B;&#xFF0C;&#x5E76;&#x4E14;&#x5F53;&#x7ED9;&#x5B9A;&#x4E00;&#x4E2A;&#x4F7F;&#x7528; TensorFlow &#x8BAD;&#x7EC3;&#x597D;&#x7684;&#x6A21;&#x578B; LIF &#x53EF;&#x4EE5;&#x81EA;&#x52A8;&#x63D0;&#x53D6;&#x6743;&#x91CD;&#xFF0C;&#x5E76;&#x6839;&#x636E;&#x89C4;&#x8303;&#x751F;&#x6210;&#x9AD8;&#x6548;&#x7684;&#x7D22;&#x5F15;&#x7ED3;&#x6784;&#x3002;&#x4F7F;&#x7528; XLA &#x7684; TensorFlow &#x53EF;&#x4EE5;&#x652F;&#x6301;&#x4EE3;&#x7801;&#x7F16;&#x8BD1;&#xFF0C;&#x4F46;&#x662F;&#x4E3B;&#x8981;&#x7528;&#x4E8E;&#x5927;&#x578B;&#x6A21;&#x578B;&#xFF0C;&#x76F8;&#x6BD4;&#x4E4B;&#x4E0B; LIF &#x4E13;&#x6CE8;&#x4E8E;&#x5C0F;&#x578B;&#x6A21;&#x578B;&#x3002;</p><p>&#x8FD9;&#x4E00;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#x4E3B;&#x8981;&#x7528;&#x4E8E;&#x89E3;&#x51B3;&#x5F53;&#x6570;&#x636E;&#x5206;&#x5E03;&#x6539;&#x53D8;&#x65F6;&#x9700;&#x8981;&#x91CD;&#x65B0;&#x8BAD;&#x7EC3;&#x6A21;&#x578B;&#x7684;&#x65F6;&#x95F4;&#x5F00;&#x9500;&#x3002;</p><h3 id="The-Recursive-Model-Index"><a href="#The-Recursive-Model-Index" class="headerlink" title="The Recursive Model Index"></a>The Recursive Model Index</h3><p>&#x5B9E;&#x9A8C;&#x5DF2;&#x7ECF;&#x53D1;&#x73B0;&#xFF0C;&#x76F4;&#x63A5;&#x4E0A; DNN &#x6548;&#x679C;&#x5E76;&#x4E0D;&#x597D;&#xFF1A;&#x5355;&#x6B21;&#x8BA1;&#x7B97;&#x4EE3;&#x4EF7;&#x592A;&#x5927;&#xFF0C;&#x53EA;&#x80FD;&#x7528; GPU&#xFF08;&#x800C;&#x8C03;&#x7528; GPU &#x4F1A;&#x4EA7;&#x751F;&#x4E0D;&#x5C0F;&#x7684; &#x95F4;&#x63A5;&#x8D39;&#x7528;&#xFF09;&#xFF1B;&#x800C;&#x4E14;&#x7F51;&#x7EDC;&#x5F88;&#x5E9E;&#x5927;&#xFF0C;retrain&#xFF08;&#x589E;&#x5220;&#x6539;&#xFF09;&#x4EE3;&#x4EF7;&#x5F88;&#x5927;&#x3002;&#x4E3A;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x51B3;&#x7B56;&#x6811;&#x7ED9;&#x6211;&#x4EEC;&#x505A;&#x4E86;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x63D0;&#x793A;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x6A21;&#x578B;&#x89E3;&#x51B3;&#x4E0D;&#x4E86;&#x95EE;&#x9898;&#xFF0C;&#x5C31;&#x518D;&#x52A0;&#x51E0;&#x5C42;&#x3002;</p><p>&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF1A;&#x4E3A; 100M &#x8BB0;&#x5F55;&#x8BAD;&#x7EC3;&#x4E00;&#x4E2A;&#x8DB3;&#x591F;&#x7CBE;&#x786E;&#x7684;&#x9884;&#x6D4B;&#x5668;&#x592A;&#x96BE;&#xFF0C;&#x90A3;&#x5C31;&#x5206;&#x6210; 3 &#x5C42;&#x6811;&#x72B6;&#x7ED3;&#x6784;&#x3002;&#x6839;&#x8282;&#x70B9;&#x5206;&#x7C7B;&#x5668;&#x628A;&#x8BB0;&#x5F55;&#x5206;&#x51FA; 100 &#x4EFD;&#xFF0C;&#x6BCF;&#x4EFD;&#x5927;&#x7EA6;&#x6709; 1M &#x8BB0;&#x5F55;&#xFF1B;&#x7B2C;&#x4E8C;&#x5C42;&#x518D;&#x5206;&#x51FA; 100 &#x4EFD;&#xFF0C;&#x6BCF;&#x4EFD;&#x5927;&#x7EA6;&#x53EA;&#x5269; 10K &#x8BB0;&#x5F55;&#xFF1B;&#x7B2C;&#x4E09;&#x5C42;&#x518D;&#x5206;&#x51FA; 100 &#x4EFD;&#xFF0C;&#x6BCF;&#x4EFD;&#x5927;&#x7EA6;&#x6709; 100 &#x6761;&#x8BB0;&#x5F55;&#x2014;&#x2014;&#x5047;&#x8BBE; 100 &#x6761;&#x7EAA;&#x5F55;&#x8DB3;&#x591F;&#x628A;&#x8BEF;&#x5DEE;&#x5728; min/max_err &#x4E4B;&#x5185;&#x3002;</p><p>RM-Index&#x7ED3;&#x6784;&#x793A;&#x610F;&#xFF1A;</p><p><img src="/2019/11/12/learned-index&#x5B66;&#x4E60;&#x7B14;&#x8BB0;/4970205-9476d2a6100450b2.webp" style="zoom:50%;"></p><p>&#x8FD9;&#x79CD;&#x6A21;&#x578B;&#x7ED3;&#x6784;&#x7684;&#x597D;&#x5904;&#x662F;&#xFF1A;</p><ol><li>&#x5F88;&#x5BB9;&#x6613;&#x5B66;&#x4E60;&#x6574;&#x4F53;&#x6570;&#x636E;&#x5206;&#x5E03;</li><li>&#x5C06;&#x6574;&#x4E2A;&#x7A7A;&#x95F4;&#x5206;&#x5272;&#x4E3A;&#x66F4;&#x5C0F;&#x7684;&#x5B50;&#x533A;&#x95F4;&#xFF0C;&#x6BCF;&#x4E2A;&#x5B50;&#x533A;&#x95F4;&#x90FD;&#x7C7B;&#x4F3C;&#x4E8E;&#x4E00;&#x4E2A; B &#x6811;&#x6216;&#x8005;&#x51B3;&#x7B56;&#x6811;&#xFF0C;&#x66F4;&#x5BB9;&#x6613;&#x53BB;&#x89E3;&#x51B3;&#x6700;&#x540E;&#x4E00;&#x516C;&#x91CC;&#x7684;&#x7CBE;&#x5EA6;&#x95EE;&#x9898;</li><li>&#x4E0D;&#x540C;&#x7684;&#x5C42;&#x4E4B;&#x95F4;&#x4E0D;&#x9700;&#x8981;&#x641C;&#x7D22;&#xFF0C;&#x6BD4;&#x5982; model 1.1 &#x8F93;&#x51FA;&#x7684; y &#x662F;&#x4E00;&#x4E2A;&#x504F;&#x79FB;&#x91CF;&#xFF0C;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x7528;&#x4E8E;&#x6311;&#x9009;&#x4E0B;&#x4E00;&#x5C42;&#x7684;&#x6A21;&#x578B;</li></ol><p>&#x6BCF;&#x4E2A; NN &#x6A21;&#x578B;&#x5C31;&#x50CF;&#x4E00;&#x4E2A;&#x7CBE;&#x901A;&#x81EA;&#x5DF1;&#x9886;&#x57DF;&#x7684;&#x4E13;&#x5BB6;&#xFF0C;&#x4ED6;&#x53EA;&#x8981;&#x5B66;&#x4E60;&#x67D0;&#x4E2A;&#x5F88;&#x5C0F;&#x5B50;&#x96C6;&#x7684; keys &#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;&#x8FD9;&#x4E5F;&#x540C;&#x65F6;&#x89E3;&#x51B3;&#x4E86; last mile &#x96BE;&#x9898;&#xFF0C;&#x5927;&#x4E0D;&#x4E86;&#x4E3A;&#x8FD9;&#x4E00;&#x767E;&#x5DE6;&#x53F3;&#x4E2A; keys &#x8FC7;&#x62DF;&#x5408;&#x4E00;&#x4E0B;&#x4E5F;&#x65E0;&#x59A8;&#x3002;</p><h2 id="&#x6DF7;&#x5408;&#x7D22;&#x5F15;"><a href="#&#x6DF7;&#x5408;&#x7D22;&#x5F15;" class="headerlink" title="&#x6DF7;&#x5408;&#x7D22;&#x5F15;"></a>&#x6DF7;&#x5408;&#x7D22;&#x5F15;</h2><p>&#x9012;&#x5F52;&#x6A21;&#x578B;&#x7D22;&#x5F15;&#xFF08;RM-Index&#xFF09;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x4F18;&#x70B9;&#x662F;&#x80FD;&#x591F;&#x4F7F;&#x7528;&#x6DF7;&#x5408;&#x6A21;&#x578B;&#xFF0C;&#x6BD4;&#x5982;&#x9876;&#x5C42;&#xFF0C;&#x53EF;&#x80FD;&#x4F7F;&#x7528; ReLU &#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x662F;&#x6700;&#x597D;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x53EF;&#x4EE5;&#x5B66;&#x4E60;&#x5927;&#x8303;&#x56F4;&#x7684;&#x590D;&#x6742;&#x6570;&#x636E;&#x5206;&#x5E03;&#xFF0C;&#x4F46;&#x662F;&#x4E0B;&#x5C42;&#x6A21;&#x578B;&#x53EF;&#x80FD;&#x4F7F;&#x7528;&#x7B80;&#x5355;&#x7684;&#x7EBF;&#x6027;&#x56DE;&#x5F52;&#x6A21;&#x578B;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x65F6;&#x95F4;&#x548C;&#x7A7A;&#x95F4;&#x7684;&#x5F00;&#x9500;&#x90FD;&#x76F8;&#x5BF9;&#x66F4;&#x5C0F;&#x4E00;&#x4E9B;&#xFF0C;&#x540C;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x6570;&#x636E;&#x5206;&#x5E03;&#x5F88;&#x96BE;&#x5B66;&#x4E60;&#xFF0C;&#x6211;&#x4EEC;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x8BBE;&#x7F6E;&#x9608;&#x503C;&#xFF0C;&#x5728;&#x6700;&#x7EC8;&#x9636;&#x6BB5;&#x4F7F;&#x7528;&#x4F20;&#x7EDF; B &#x6811;&#x3002;</p><p>&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x6700;&#x540E;&#x9009;&#x7528;&#x4E86;&#x4E24;&#x79CD; Model&#xFF1A;</p><ul><li>&#x7B80;&#x5355;&#x7684;DNN&#xFF08;0&#xFF5E;2 &#x5C42;&#x5168;&#x8FDE;&#x63A5;&#x7684; hidden layer&#xFF0C;ReLU &#x6FC0;&#x53D1;&#x51FD;&#x6570;&#xFF0C;&#x6BCF;&#x5C42;&#x6700;&#x591A; 32 &#x4E2A;&#x795E;&#x7ECF;&#x5143;&#xFF09;</li><li>&#x5F53;&#x53F6;&#x8282;&#x70B9;&#x7684; NN &#x6A21;&#x578B; error rate &#x8D85;&#x8FC7;&#x9608;&#x503C;&#x65F6;&#xFF0C;&#x66FF;&#x6362;&#x6210; B &#x6811;</li></ul><p>&#x8BAD;&#x7EC3;&#x7B97;&#x6CD5;&#x5982;&#x4E0B;&#xFF1A;</p><p><img src="/2019/11/12/learned-index&#x5B66;&#x4E60;&#x7B14;&#x8BB0;/4970205-80e92630e20bba66.webp" style="zoom:67%;"></p><p>4-10&#x884C;&#x5B9E;&#x73B0;&#x4E86;&#x57FA;&#x4E8E;&#x9876;&#x70B9;&#x6A21;&#x578B;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#xFF0C;&#x5E76;&#x5C06;&#x8303;&#x56F4;&#x5185;&#x7684; key &#x5B58;&#x5165;&#xFF1B;11-14&#x884C;&#xFF0C;&#x6839;&#x636E;&#x9608;&#x503C;&#x51B3;&#x5B9A;&#x662F;&#x5426;&#x4F7F;&#x7528; B &#x6811;&#x4EE3;&#x66FF;&#x6A21;&#x578B;&#x3002;</p><p>1.&#x56FA;&#x5B9A;&#x6574;&#x4E2A; RM-Index &#x7684;&#x7ED3;&#x6784;&#xFF0C;&#x6BD4;&#x5982;&#x5C42;&#x6570;&#x3001;&#x6BCF;&#x5C42; Model &#x6570;&#x91CF;&#x7B49;&#xFF08;&#x53EF;&#x4EE5;&#x7528;&#x7F51;&#x683C;&#x6CD5;&#x8C03;&#x53C2;&#xFF09;&#xFF1B;</p><p>2.&#x7528;&#x5168;&#x90E8;&#x6570;&#x636E;&#x8BAD;&#x7EC3;&#x6839;&#x8282;&#x70B9;&#xFF0C;&#x7136;&#x540E;&#x7528;&#x6839;&#x8282;&#x70B9;&#x5206;&#x7C7B;&#x540E;&#x7684;&#x6570;&#x636E;&#x8BAD;&#x7EC3;&#x7B2C;&#x4E8C;&#x5C42;&#x6A21;&#x578B;&#xFF0C;&#x518D;&#x7528;&#x7B2C;&#x4E8C;&#x5C42;&#x5206;&#x7C7B;&#x540E;&#x7684;&#x6570;&#x636E;&#x8BAD;&#x7EC3;&#x7B2C;&#x4E09;&#x5C42;&#xFF1B;</p><p>3.&#x5BF9;&#x4E8E;&#x7B2C;&#x4E09;&#x5C42;&#xFF08;&#x53F6;&#x8282;&#x70B9;&#xFF09;&#xFF0C;&#x5982;&#x679C; max_error &#x5927;&#x4E8E;&#x9884;&#x8BBE;&#x7684;&#x9608;&#x503C;&#xFF0C;&#x5C31;&#x6362;&#x6210; B &#x6811;&#x3002;</p><h2 id="&#x641C;&#x7D22;&#x7B56;&#x7565;"><a href="#&#x641C;&#x7D22;&#x7B56;&#x7565;" class="headerlink" title="&#x641C;&#x7D22;&#x7B56;&#x7565;"></a>&#x641C;&#x7D22;&#x7B56;&#x7565;</h2><p>paper &#x4E2D;&#x63D0;&#x51FA;&#x4E86;&#x4E09;&#x79CD;&#x641C;&#x7D22;&#x7B56;&#x7565;&#xFF1A;</p><ol><li>Model Biased Search&#xFF1A;&#x9ED8;&#x8BA4;&#x641C;&#x7D22;&#x7B56;&#x7565;&#xFF0C;&#x7C7B;&#x4F3C;&#x4F20;&#x7EDF;&#x4E8C;&#x5206;&#x641C;&#x7D22;&#xFF0C;&#x4E0D;&#x540C;&#x70B9;&#x5728;&#x4E8E;&#x521D;&#x59CB;&#x7684;&#x4E2D;&#x95F4;&#x70B9;&#x88AB;&#x8BBE;&#x7F6E;&#x4E3A;&#x6A21;&#x578B;&#x9884;&#x6D4B;&#x7684;&#x7ED3;&#x679C;</li><li>Biased Quaternary Search&#xFF1A;&#x540C;&#x65F6;&#x67E5;&#x627E;&#x4E09;&#x4E2A;&#x70B9;&#xFF0C;pos-&#x3C3;&#xFF0C;pos&#xFF0C;pos+&#x3C3;&#xFF0C;&#x9700;&#x8981; CPU &#x53EF;&#x4EE5;&#x4ECE;&#x4E3B;&#x5B58;&#x4E2D;&#x5E76;&#x884C;&#x83B7;&#x53D6;&#x591A;&#x4E2A;&#x6570;&#x636E;&#x5730;&#x5740;&#xFF0C;&#x7136;&#x540E;&#x8FDB;&#x884C;&#x56DB;&#x5143;&#x641C;&#x7D22;</li></ol><h2 id="&#x6D4B;&#x8BD5;&#x7ED3;&#x679C;"><a href="#&#x6D4B;&#x8BD5;&#x7ED3;&#x679C;" class="headerlink" title="&#x6D4B;&#x8BD5;&#x7ED3;&#x679C;"></a>&#x6D4B;&#x8BD5;&#x7ED3;&#x679C;</h2><p>&#x4E3A;&#x4E86;&#x5BF9;&#x6BD4; RM-Index &#x548C; B &#x6811;&#x7684;&#x6027;&#x80FD;&#xFF0C;&#x8BBA;&#x6587;&#x4F5C;&#x8005;&#x627E;&#x4E86; 4 &#x4E2A;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x5206;&#x522B;&#x7528; RM-Index &#x548C; B &#x6811;&#x4F5C;&#x4E8C;&#x7EA7;&#x7D22;&#x5F15;&#x3002;</p><ul><li>Weblogs &#x6570;&#x636E;&#x96C6;&#xFF1A;&#x8BBF;&#x95EE;&#x65F6;&#x95F4; timestamp -&gt; log entry &#xFF08;&#x7EA6; 200M&#xFF09;</li><li>Maps &#x6570;&#x636E;&#x96C6;&#xFF1A;&#x7EAC;&#x5EA6; longitude -&gt; locations &#xFF08;&#x7EA6; 200M&#xFF09;</li><li>Web-documents &#x6570;&#x636E;&#x96C6;&#xFF1A;documents&#xFF08;&#x5B57;&#x7B26;&#x4E32;&#xFF09;-&gt; document-id&#xFF08;&#x7EA6; 10M&#xFF09;</li><li>Lognormal &#x6570;&#x636E;&#x96C6;&#xFF1A;&#x6309;&#x5BF9;&#x6570;&#x6B63;&#x6001;&#x5206;&#x5E03;&#x968F;&#x673A;&#x751F;&#x6210;&#x7684;&#x6570;&#x636E;</li></ul><p>&#x6D4B;&#x8BD5;&#x4E2D;&#x7528;&#x4E86;&#x4E0D;&#x540C;&#x53C2;&#x6570;&#x7684; Learned Index &#x548C; B &#x6811;&#xFF0C;B &#x6811;&#x4E5F;&#x7528;&#x4E86;&#x4E00;&#x4E2A;&#x9AD8;&#x5EA6;&#x4F18;&#x5316;&#x7684;&#x5B9E;&#x73B0;&#x3002;</p><p><img src="/2019/11/12/learned-index&#x5B66;&#x4E60;&#x7B14;&#x8BB0;/e174ebf808404dd59550d5d92b0fee14.jpeg" style="zoom:67%;"></p><h2 id="&#x63D2;&#x5165;"><a href="#&#x63D2;&#x5165;" class="headerlink" title="&#x63D2;&#x5165;"></a>&#x63D2;&#x5165;</h2><p>&#x5B66;&#x4E60;&#x7D22;&#x5F15;&#x7684;&#x4E3B;&#x8981;&#x7F3A;&#x70B9;&#x662F;&#x5B83;&#x7684;&#x9759;&#x6001;&#x6027;&#x8D28;&#x3002;&#x5176;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E0D;&#x652F;&#x6301;&#x4EFB;&#x4F55;&#x4FEE;&#x6539;&#xFF0C;&#x5305;&#x62EC;&#x63D2;&#x5165;&#x3001;&#x66F4;&#x65B0;&#x6216;&#x5220;&#x9664;&#x3002;&#x7ED9;&#x5B9A;&#x4E00;&#x4E2A;&#x8981;&#x63D2;&#x5165;&#x7684;&#x952E;k&#xFF0C;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x4F7F;&#x7528;&#x8BE5;&#x6A21;&#x578B;&#x627E;&#x5230;k&#x7684;&#x63D2;&#x5165;&#x4F4D;&#x7F6E;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x6570;&#x7EC4;&#xFF0C;&#x5176;&#x957F;&#x5EA6;&#x4E3A;1&#x52A0;&#x4E0A;&#x65E7;&#x6570;&#x7EC4;&#x7684;&#x957F;&#x5EA6;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x6570;&#x636E;&#x4ECE;&#x65E7;&#x6570;&#x7EC4;&#x590D;&#x5236;&#x5230;&#x65B0;&#x6570;&#x7EC4;&#xFF0C;&#x5176;&#x4E2D;k&#x7684;&#x63D2;&#x5165;&#x4F4D;&#x7F6E;&#x53F3;&#x4FA7;&#x7684;&#x5143;&#x7D20;&#x5411;&#x53F3;&#x79FB;&#x52A8;&#x4E00;&#x4E2A;&#x4F4D;&#x7F6E;&#x3002;&#x6211;&#x4EEC;&#x5728;&#x65B0;&#x6570;&#x7EC4;&#x7684;&#x63D2;&#x5165;&#x4F4D;&#x7F6E;&#x63D2;&#x5165;k&#x3002;&#x6700;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x66F4;&#x65B0;&#x6A21;&#x578B;&#x4EE5;&#x53CD;&#x6620;&#x6570;&#x636E;&#x5206;&#x5E03;&#x7684;&#x53D8;&#x5316;&#x3002;</p><p>&#x8FD9;&#x79CD;&#x7B56;&#x7565;&#x5BF9;&#x4E8E;&#x6570;&#x636E;&#x5927;&#x5C0F;&#x5177;&#x6709;&#x7EBF;&#x6027;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x6027;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x968F;&#x7740;&#x6570;&#x636E;&#x7684;&#x63D2;&#x5165;&#xFF0C;RMI&#x6A21;&#x578B;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x63A8;&#x79FB;&#x53D8;&#x5F97;&#x4E0D;&#x90A3;&#x4E48;&#x7CBE;&#x786E;&#xFF0C;&#x8FD9;&#x9700;&#x8981;&#x5BF9;&#x6A21;&#x578B;&#x8FDB;&#x884C;&#x518D;&#x57F9;&#x8BAD;&#xFF0C;&#x8FDB;&#x4E00;&#x6B65;&#x589E;&#x52A0;&#x4E86;&#x63D2;&#x5165;&#x7684;&#x6210;&#x672C;&#x3002;&#x663E;&#x7136;&#xFF0C;&#x8FD9;&#x79CD;&#x5929;&#x771F;&#x7684;&#x63D2;&#x5165;&#x7B56;&#x7565;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#x662F;&#x4E0D;&#x53EF;&#x63A5;&#x53D7;&#x7684;&#x3002;</p><h2 id="Point-Index"><a href="#Point-Index" class="headerlink" title="Point Index"></a>Point Index</h2><p> point index&#xFF08;hash&#x7D22;&#x5F15;&#xFF09;&#x7684;&#x4F18;&#x5316;&#x57FA;&#x7840;&#x5728;&#x4E8E;&#xFF0C;&#x5178;&#x578B;&#x7684;&#x6570;&#x636E;&#x51B2;&#x7A81;&#x53EF;&#x80FD;&#x4F1A;&#x6709;33%&#xFF08;&#x5982;&#x751F;&#x65E5;&#xFF09;&#x3002;&#x7136;&#x800C;&#x5B9E;&#x9645;&#x51CF;&#x5C11;&#x51B2;&#x7A81;&#x548C;&#x8FD0;&#x884C;&#x6548;&#x679C;&#x53D6;&#x51B3;&#x4E8E;&#x4E24;&#x4E2A;&#x4E3B;&#x8981;&#x65B9;&#x9762;&#xFF1A;</p><ol><li>&#x6570;&#x636E;&#x672C;&#x8EAB;&#x7684;&#x5206;&#x5E03;&#x60C5;&#x51B5;&#x3002;&#x6BD4;&#x5982;&#x5747;&#x5300;&#x5206;&#x5E03;&#x573A;&#x666F;&#x4E0B;&#xFF0C;learned index&#x4E0D;&#x4F1A;&#x6BD4;&#x666E;&#x901A;&#x7684;&#x968F;&#x673A;hash&#x51FD;&#x6570;&#x597D;&#x591A;&#x5C11;&#xFF1B;</li><li>&#x5176;&#x4ED6;payload&#x7B49;</li></ol><p>&#x901A;&#x8FC7;&#x6563;&#x5217;&#x6620;&#x5C04;&#x7684;&#x76EE;&#x6807;&#x5927;&#x5C0F;M&#x6765;&#x6269;&#x5C55;CDF&#xFF0C;&#x5E76;&#x4F7F;&#x7528;<em>h(K) = F (K) \</em>M*&#xFF0C;K&#x662F;&#x6563;&#x5217;&#x51FD;&#x6570;&#x7684;&#x952E;&#x3002;</p><p>&#x5982;&#x679C;&#x6A21;&#x578B;F&#x5B8C;&#x7F8E;&#x5730;&#x5B66;&#x4E60;&#x4E86;&#x952E;&#x7684;&#x7ECF;&#x9A8C;CDF&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x4E0D;&#x4F1A;&#x5B58;&#x5728;&#x51B2;&#x7A81;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x6563;&#x5217;&#x51FD;&#x6570;&#x4E0E;&#x5B9E;&#x9645;&#x7684;&#x6563;&#x5217;&#x6620;&#x5C04;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x662F;&#x6B63;&#x4EA4;&#x7684;&#xFF0C;&#x53EF;&#x4EE5;&#x4E0E;&#x5355;&#x72EC;&#x7684;&#x94FE;&#x63A5;&#x6216;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x6563;&#x5217;&#x6620;&#x5C04;&#x7C7B;&#x578B;&#x76F8;&#x7ED3;&#x5408;&#x3002;&#x5BF9;&#x4E8E;&#x8BE5;&#x6A21;&#x578B;&#xFF0C;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x518D;&#x6B21;&#x5229;&#x7528;&#x9012;&#x5F52;&#x6A21;&#x578B;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x3002;</p><p>&#x4ECE;&#x6587;&#x7AE0;&#x7684;&#x6570;&#x636E;&#x96C6;&#x6765;&#x8BF4;&#xFF0C;&#x8FD8;&#x662F;&#x6709;&#x6548;&#x679C;&#x7684;&#xFF1A;</p><p><img src="/2019/11/12/learned-index&#x5B66;&#x4E60;&#x7B14;&#x8BB0;/117546-20190416001105042-1000082435.png" style="zoom: 25%;"></p><h2 id="EXISTENCE-INDEX"><a href="#EXISTENCE-INDEX" class="headerlink" title="EXISTENCE INDEX"></a>EXISTENCE INDEX</h2><h3 id="Bloom-filters&#x4F5C;&#x4E3A;&#x5206;&#x7C7B;&#x95EE;&#x9898;"><a href="#Bloom-filters&#x4F5C;&#x4E3A;&#x5206;&#x7C7B;&#x95EE;&#x9898;" class="headerlink" title="Bloom filters&#x4F5C;&#x4E3A;&#x5206;&#x7C7B;&#x95EE;&#x9898;"></a>Bloom filters&#x4F5C;&#x4E3A;&#x5206;&#x7C7B;&#x95EE;&#x9898;</h3><p><img src="/2019/11/12/learned-index&#x5B66;&#x4E60;&#x7B14;&#x8BB0;/117546-20190416001133561-1804809781.png" style="zoom: 25%;"></p><p>&#x6211;&#x4EEC;&#x9700;&#x8981;&#x8BAD;&#x7EC3;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x4F7F;&#x5F97; log &#x635F;&#x5931;&#x51FD;&#x6570;&#x6700;&#x5C0F;&#x3002;&#x4E3A;&#x4E86;&#x6EE1;&#x8DB3;&#x5047;&#x9634;&#x6027;&#x4E3A;0&#x8FD9;&#x4E2A;&#x6761;&#x4EF6;&#xFF0C;&#x6211;&#x4EEC;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x6EA2;&#x51FA;&#x7684;&#x5E03;&#x9686;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x6839;&#x636E;&#x9608;&#x503C;&#x5B66;&#x4E60;&#x4E00;&#x4E2A;&#x6A21;&#x578B;&#xFF0C;&#x5F53;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x5927;&#x4E8E;&#x7B49;&#x4E8E;&#x9608;&#x503C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x8BA4;&#x4E3A;&#x8FD9;&#x4E2A; key &#x662F;&#x5B58;&#x5728;&#x4E8E; set &#x4E2D;&#x7684;&#xFF0C;&#x5F53;&#x5C0F;&#x4E8E;&#x9608;&#x503C;&#x65F6;&#xFF0C;&#x5219;&#x53BB; check &#x6EA2;&#x51FA;&#x7684;&#x5E03;&#x9686;&#x8FC7;&#x6EE4;&#x5668;&#x3002;</p><p>&#x7B80;&#x5355;&#x7684;&#x8BF4;&#xFF0C;&#x5C31;&#x662F;&#x5C06;&#x5B58;&#x5728;&#x7684; key &#x548C;&#x4E0D;&#x5B58;&#x5728;&#x7684; key &#x5212;&#x5206;&#x4E3A;&#x4E24;&#x4E2A;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x7136;&#x540E;&#x878D;&#x5408;&#x5230;&#x4E00;&#x4E2A;&#x96C6;&#x5408;&#x4E2D;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#xFF0C;&#x6700;&#x5C0F;&#x5316;&#x4E00;&#x4E2A; log &#x635F;&#x5931;&#x51FD;&#x6570;&#x3002;</p><h3 id="&#x5E26;Hash&#x6A21;&#x578B;&#x7684;Bloom-filter"><a href="#&#x5E26;Hash&#x6A21;&#x578B;&#x7684;Bloom-filter" class="headerlink" title="&#x5E26;Hash&#x6A21;&#x578B;&#x7684;Bloom filter"></a>&#x5E26;Hash&#x6A21;&#x578B;&#x7684;Bloom filter</h3><p>&#x5C06;&#x5E03;&#x9686;&#x8FC7;&#x6EE4;&#x5668;&#x89C6;&#x4F5C;&#x4E00;&#x4E2A;&#x5206;&#x7C7B;&#x95EE;&#x9898;&#x65F6;&#x4E0E;&#x5E03;&#x9686;&#x8FC7;&#x6EE4;&#x5668;&#x4E2D;&#x7684;&#x6563;&#x5217;&#x51FD;&#x6570;&#x672C;&#x8EAB;&#x662F;&#x77DB;&#x76FE;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x6CA1;&#x6709;&#x533A;&#x95F4;&#x5177;&#x6709;&#x975E;&#x96F6;&#x7684; FNR&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; f(x) &#x6620;&#x5C04;&#x5230; m &#x7684;&#x4F4D;&#x6570;&#x7EC4;&#x4E0A;&#xFF0C;f(x) &#x6620;&#x5C04;&#x8303;&#x56F4;&#x662F;[0,1]&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5047;&#x8BBE; d &#x5982;&#x4E0B;&#xFF0C;&#x4F5C;&#x7528;&#x662F;&#x79BB;&#x6563;&#x5316;&#x7A7A;&#x95F4;&#x3002;</p><p>&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; d(f(x)) &#x4F5C;&#x4E3A;&#x6563;&#x5217;&#x51FD;&#x6570;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x5C06;&#x5B58;&#x5728;&#x7684; key &#x6620;&#x5C04;&#x5230; bit &#x7684;&#x9AD8;&#x4F4D;&#x4E0A;&#xFF0C;&#x5C06;&#x4E0D;&#x5B58;&#x5728;&#x7684; key &#x6620;&#x5C04;&#x5230; bit &#x7684;&#x4F4E;&#x4F4D;&#x4E0A;&#x3002;</p><p>f(x) &#x2208; [0,1]&#xFF0C;&#x5F53; key &#x4E0D;&#x5B58;&#x5728;&#x65F6;&#xFF0C;f(x)&#x66F4;&#x63A5;&#x8FD1;&#x4E8E;0&#xFF0C;&#x53CD;&#x4E4B;&#xFF0C;&#x66F4;&#x63A5;&#x8FD1;&#x4E8E;1&#xFF0C;&#x6240;&#x4EE5; key &#x5927;&#x591A;&#x5206;&#x5E03;&#x5728;&#x9AD8;&#x4F4D;&#x4E0A;&#xFF0C;non-key &#x5927;&#x591A;&#x5206;&#x5E03;&#x5728;&#x4F4E;&#x4F4D;&#x4E0A;&#x3002;</p><h2 id="&#x603B;&#x7ED3;"><a href="#&#x603B;&#x7ED3;" class="headerlink" title="&#x603B;&#x7ED3;"></a>&#x603B;&#x7ED3;</h2><p>Learned index&#x9002;&#x7528;&#x4E8E;&#x89C4;&#x5F8B;&#x6027;&#x5F3A;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x4F5C;&#x8FD9;&#x79CD;&#x6570;&#x636E;&#x7684;&#x4E8C;&#x7EA7;&#x7D22;&#x5F15;&#x518D;&#x5408;&#x9002;&#x4E0D;&#x8FC7;&#x4E86;&#x3002;&#x5185;&#x5728;&#x89C4;&#x5F8B;&#x8D8A;&#x5F3A;&#xFF0C;&#x5C31;&#x610F;&#x5473;&#x7740; B &#x6811;&#x3001;&#x54C8;&#x5E0C;&#x8FD9;&#x4E9B;&#x901A;&#x7528;&#x7B97;&#x6CD5;&#x6D6A;&#x8D39;&#x7684;&#x8D8A;&#x591A;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;ML&#x7B97;&#x6CD5;&#x80FD;&#x6361;&#x5230;&#x4FBF;&#x5B9C;&#x7684;&#x5730;&#x65B9;&#x3002;</p><p>&#x7136;&#x800C;&#x7F3A;&#x70B9;&#x4E5F;&#x662F;&#x660E;&#x663E;&#x7684;&#xFF1A;&#x589E;&#x5220;&#x6539;&#x4EE3;&#x4EF7;&#x96BE;&#x4EE5;&#x63A7;&#x5236;&#xFF0C;&#x7531;&#x4E8E;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x8BAD;&#x7EC3;&#x7684;&#x65F6;&#x95F4;&#x4EE5;&#x53CA;&#x7A7A;&#x95F4;&#x7684;&#x590D;&#x6742;&#x6027;&#xFF0C;&#x8FD9;&#x8DB3;&#x4EE5;&#x78E8;&#x5E73;&#x5B83;&#x67E5;&#x627E;&#x7684;&#x4F18;&#x52BF;&#xFF0C;&#x6BD5;&#x7ADF;&#x5927;&#x90E8;&#x5206;&#x7684;&#x6570;&#x636E;&#x5E93;&#x90FD;&#x662F;&#x8981;&#x8FDB;&#x884C;&#x9891;&#x7E41;&#x7684;&#x589E;&#x5220;&#x6539;&#x64CD;&#x4F5C;&#x7684;&#x3002;</p><p>&#x4F46;&#x662F;&#xFF0C;&#x4E0D;&#x5F97;&#x4E0D;&#x80AF;&#x5B9A;&#x7684;&#x662F;&#xFF0C;&#x4F5C;&#x4E3A;&#x5E94;&#x7528;&#x8303;&#x56F4;&#x6700;&#x5E7F;&#x7684;B&#x6811;&#x7684;&#x5730;&#x4F4D;&#x662F;&#x96BE;&#x4EE5;&#x64BC;&#x52A8;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x7279;&#x5B9A;&#x573A;&#x666F;&#x4E0B;&#xFF08;&#x4F8B;&#x5982;&#x53EA;&#x8BFB;&#x6570;&#x636E;&#x5E93;&#xFF09;&#xFF0C;learned-index&#x5C06;&#x4F1A;&#x662F;&#x4E00;&#x4E2A;&#x73B0;&#x6709;&#x65B9;&#x6CD5;&#x7684;&#x8865;&#x5145;&#x3002;</p><h2 id="&#x53EF;&#x80FD;&#x6539;&#x8FDB;"><a href="#&#x53EF;&#x80FD;&#x6539;&#x8FDB;" class="headerlink" title="&#x53EF;&#x80FD;&#x6539;&#x8FDB;"></a>&#x53EF;&#x80FD;&#x6539;&#x8FDB;</h2><figure class="image-bubble">                <div class="img-lightbox">                    <div class="overlay"></div>                    <img src="/2019/11/12/learned-index&#x5B66;&#x4E60;&#x7B14;&#x8BB0;/1905.jpg" alt="1905" title="">                </div>                <div class="image-caption">1905</div>            </figure>]]></content>
    
    <summary type="html">
    
      
      
        &lt;p&gt;&amp;#x8BBA;&amp;#x6587;&amp;#x94FE;&amp;#x63A5;&amp;#xFF1A;&lt;a href=&quot;https://www.researchgate.net/publication/321512926_The_Case_for_Learned_Index_Structures
      
    
    </summary>
    
    
    
      <category term="Learned index" scheme="http://infinitymiao.cn/tags/Learned-index/"/>
    
      <category term="机器学习" scheme="http://infinitymiao.cn/tags/%E6%9C%BA%E5%99%A8%E5%AD%A6%E4%B9%A0/"/>
    
  </entry>
  
  <entry>
    <title>一些JavaScript的坑</title>
    <link href="http://infinitymiao.cn/2019/10/20/%E4%B8%80%E4%BA%9BJavaScript%E7%9A%84%E5%9D%91/"/>
    <id>http://infinitymiao.cn/2019/10/20/一些JavaScript的坑/</id>
    <published>2019-10-20T14:47:33.410Z</published>
    <updated>2019-10-28T11:08:51.577Z</updated>
    
    <content type="html"><![CDATA[<p>&#x4E0D;&#x5F97;&#x4E0D;&#x8BF4;js&#x662F;&#x4E00;&#x79CD;&#x6709;&#x70B9;&#x5947;&#x8469;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x6709;&#x5F88;&#x591A;&#x7684;&#x5730;&#x65B9;&#x548C;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#x4E0D;&#x540C;&#xFF0C;&#x5728;&#x5199;js&#x7684;&#x65F6;&#x5019;&#x5982;&#x679C;&#x7406;&#x6240;&#x5F53;&#x7136;&#x7684;&#x7528;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#x7684;&#x65B9;&#x6CD5;&#x53BB;&#x5199;&#x4F1A;&#x6709;&#x5F88;&#x591A;&#x7684;&#x95EE;&#x9898;&#x3002;</p><p>&#x56E0;&#x6B64;&#x5728;&#x8FD9;&#x91CC;&#x5C06;&#x4F1A;&#x6709;&#x4E00;&#x4E9B;JavaScript&#x4E0E;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#x7684;&#x201C;&#x4E0E;&#x4F17;&#x4E0D;&#x540C;&#x201D;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x907F;&#x514D;&#x4EE5;&#x540E;&#x518D;&#x8E29;&#x3002;</p><h2 id="&#x6570;&#x7EC4;&#x7684;&#x6392;&#x5E8F;"><a href="#&#x6570;&#x7EC4;&#x7684;&#x6392;&#x5E8F;" class="headerlink" title="&#x6570;&#x7EC4;&#x7684;&#x6392;&#x5E8F;"></a>&#x6570;&#x7EC4;&#x7684;&#x6392;&#x5E8F;</h2><p>JavaScript&#x6570;&#x7EC4;&#x9ED8;&#x8BA4;&#x7684;&#x6392;&#x5E8F;&#x65B9;&#x5F0F;&#x5F88;&#x5947;&#x8469;&#xFF0C;&#x5B83;&#x9ED8;&#x8BA4;&#x7684;&#x6392;&#x5E8F;&#x65B9;&#x5F0F;array.sort()&#x7C7B;&#x4F3C;&#x4E8E;python&#x4E2D;&#x7531;&#x5B57;&#x7B26;&#x4E32;&#x6784;&#x6210;&#x7684;&#x6570;&#x7EC4;&#x3002;</p><figure class="highlight javascript"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">let</span> array = [<span class="number">1</span>,<span class="number">2</span>,<span class="number">13</span>,<span class="number">23</span>,<span class="number">5</span>,<span class="number">7</span>,<span class="number">8</span>,<span class="number">10</span>,<span class="number">11</span>,<span class="number">13</span>,<span class="number">14</span>,<span class="number">16</span>,<span class="number">17</span>,<span class="number">19</span>,<span class="number">20</span>,<span class="number">22</span>];</span><br><span class="line">array.sort()</span><br><span class="line"><span class="built_in">console</span>.log(array)</span><br><span class="line"></span><br><span class="line">&#x63A7;&#x5236;&#x53F0;&#x8F93;&#x51FA;&#xFF1A;</span><br><span class="line">[ <span class="number">1</span>, <span class="number">10</span>, <span class="number">11</span>, <span class="number">13</span>, <span class="number">13</span>, <span class="number">14</span>, <span class="number">16</span>, <span class="number">17</span>, <span class="number">19</span>, <span class="number">2</span>, <span class="number">20</span>, <span class="number">22</span>, <span class="number">23</span>, <span class="number">5</span>, <span class="number">7</span>, <span class="number">8</span> ]</span><br></pre></td></tr></table></figure><p>&#x800C;&#x5982;&#x679C;&#x8981;&#x5BF9;js&#x7684;&#x6570;&#x7EC4;&#x8FDB;&#x884C;&#x6B63;&#x5E38;&#x7684;&#x6392;&#x5E8F;&#xFF0C;&#x9700;&#x8981;&#x81EA;&#x5DF1;&#x5199;&#x5224;&#x65AD;&#x5927;&#x5C0F;&#x7684;&#x51FD;&#x6570;</p><figure class="highlight javascript"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">let</span> array = [<span class="number">1</span>,<span class="number">2</span>,<span class="number">13</span>,<span class="number">23</span>,<span class="number">5</span>,<span class="number">7</span>,<span class="number">8</span>,<span class="number">10</span>,<span class="number">11</span>,<span class="number">13</span>,<span class="number">14</span>,<span class="number">16</span>,<span class="number">17</span>,<span class="number">19</span>,<span class="number">20</span>,<span class="number">22</span>];</span><br><span class="line">array.sort(<span class="function"><span class="keyword">function</span> (<span class="params">m, n</span>) </span>{</span><br><span class="line">                <span class="keyword">if</span> (m &lt; n) </span><br><span class="line">                    <span class="keyword">return</span> <span class="number">-1</span></span><br><span class="line">                <span class="keyword">else</span> <span class="keyword">if</span> (m &gt; n) </span><br><span class="line">                    <span class="keyword">return</span> <span class="number">1</span></span><br><span class="line">                <span class="keyword">else</span> </span><br><span class="line">                    <span class="keyword">return</span> <span class="number">0</span></span><br><span class="line">            });</span><br><span class="line"><span class="built_in">console</span>.log(array)</span><br><span class="line"></span><br><span class="line">&#x63A7;&#x5236;&#x53F0;&#x8F93;&#x51FA;&#xFF1A;</span><br><span class="line">[ <span class="number">1</span>, <span class="number">2</span>, <span class="number">5</span>, <span class="number">7</span>, <span class="number">8</span>, <span class="number">10</span>, <span class="number">11</span>, <span class="number">13</span>, <span class="number">13</span>, <span class="number">14</span>, <span class="number">16</span>, <span class="number">17</span>, <span class="number">19</span>, <span class="number">20</span>, <span class="number">22</span>, <span class="number">23</span>]</span><br></pre></td></tr></table></figure>]]></content>
    
    <summary type="html">
    
      
      
        &lt;p&gt;&amp;#x4E0D;&amp;#x5F97;&amp;#x4E0D;&amp;#x8BF4;js&amp;#x662F;&amp;#x4E00;&amp;#x79CD;&amp;#x6709;&amp;#x70B9;&amp;#x5947;&amp;#x8469;&amp;#x7684;&amp;#x8BED;&amp;#x8A00;&amp;#xFF0C;&amp;#x6709;&amp;#x5F88
      
    
    </summary>
    
    
    
      <category term="JavaScript" scheme="http://infinitymiao.cn/tags/JavaScript/"/>
    
      <category term="Nodejs" scheme="http://infinitymiao.cn/tags/Nodejs/"/>
    
  </entry>
  
  <entry>
    <title>JavaScript的遍历方式</title>
    <link href="http://infinitymiao.cn/2019/10/18/JavaScript%E7%9A%84%E9%81%8D%E5%8E%86%E6%96%B9%E5%BC%8F/"/>
    <id>http://infinitymiao.cn/2019/10/18/JavaScript的遍历方式/</id>
    <published>2019-10-18T15:33:12.767Z</published>
    <updated>2019-10-28T11:08:13.777Z</updated>
    
    <content type="html"><![CDATA[<p>&#x4E4B;&#x524D;&#x5728;&#x5199;&#x7528;nodejs&#x6784;&#x5EFA;&#x7684;&#x7F51;&#x7AD9;&#x540E;&#x7AEF;&#x65F6;&#xFF0C;&#x7406;&#x6240;&#x5F53;&#x7136;&#x7684;&#x7528;&#x5230;&#x4E86;&#x904D;&#x5386;&#xFF0C;js&#x7684;&#x904D;&#x5386;&#x65B9;&#x5F0F;&#x6709;&#x5F88;&#x591A;&#x79CD;&#xFF0C;&#x5148;&#x8BB0;&#x4E0B;&#x7528;&#x5230;&#x4E86;&#x7684;&#x904D;&#x5386;&#x65B9;&#x5F0F;&#x4EE5;&#x53CA;&#x5176;&#x4E2D;&#x9047;&#x5230;&#x7684;&#x5751;&#x3002;</p><h2 id="1-for&#x5FAA;&#x73AF;"><a href="#1-for&#x5FAA;&#x73AF;" class="headerlink" title="1.for&#x5FAA;&#x73AF;"></a>1.for&#x5FAA;&#x73AF;</h2><p>for&#x5FAA;&#x73AF;&#x7684;&#x7528;&#x6CD5;&#x57FA;&#x672C;&#x4E0E;c/c++&#x7C7B;&#x4F3C;&#xFF0C;&#x9664;&#x4E86;&#x83B7;&#x5F97;&#x6570;&#x7EC4;&#x957F;&#x5EA6;&#x7684;&#x65B9;&#x5F0F;</p><figure class="highlight javascript"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">var</span> array = [<span class="number">1</span>,<span class="number">2</span>,<span class="number">3</span>,<span class="number">4</span>,<span class="number">5</span>,<span class="number">6</span>,<span class="number">7</span>,<span class="number">8</span>,<span class="number">9</span>];</span><br><span class="line"><span class="keyword">for</span>(<span class="keyword">let</span> i = <span class="number">0</span>;i&lt;array.length;i++){</span><br><span class="line">    <span class="built_in">console</span>.log(array[i]);</span><br><span class="line">}</span><br></pre></td></tr></table></figure><p>&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#xFF0C;&#x5728;&#x4F7F;&#x7528;for&#x5FAA;&#x73AF;&#x7684;&#x4EE3;&#x7801;&#x4E2D;&#x6CA1;&#x6709;&#x51FA;&#x73B0;&#x4EFB;&#x4F55;bug&#xFF0C;&#x56E0;&#x6B64;&#x63A8;&#x8350;&#x4EE5;&#x540E;&#x4F7F;&#x7528;&#x6700;&#x4F20;&#x7EDF;&#x7684;for&#x5FAA;&#x73AF;&#x3002;&#x800C;&#x5176;&#x4ED6;&#x7684;&#x51E0;&#x4E2D;&#x904D;&#x5386;&#x65B9;&#x5F0F;&#x591A;&#x591A;&#x5C11;&#x5C11;&#x90FD;&#x4F1A;&#x51FA;&#x73B0;&#x95EE;&#x9898;&#xFF0C;&#x4F30;&#x8BA1;&#x662F;nodejs&#x7684;&#x4EFB;&#x52A1;&#x5904;&#x7406;&#x903B;&#x8F91;&#x4F7F;&#x5F97;&#x5BF9;&#x6570;&#x7EC4;&#x5BF9;&#x8C61;&#x8FDB;&#x884C;&#x904D;&#x5386;&#x65F6;&#x51FA;&#x73B0;&#x4E86;&#x6307;&#x9488;&#x9519;&#x8BEF;&#xFF1F;&#x4E0D;&#x592A;&#x6E05;&#x695A;&#xFF0C;&#x5F85;&#x4EE5;&#x540E;&#x7814;&#x7A76;&#x3002;</p><h2 id="2-for-in"><a href="#2-for-in" class="headerlink" title="2.for in"></a>2.for in</h2><p> for in&#x5FAA;&#x73AF;&#x4E0D;&#x4EC5;&#x53EF;&#x4EE5;&#x904D;&#x5386;&#x6570;&#x7EC4;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x904D;&#x5386;&#x5BF9;&#x8C61;</p><figure class="highlight javascript"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">var</span> array = [<span class="number">1</span>,<span class="number">2</span>,<span class="number">3</span>,<span class="number">4</span>,<span class="number">5</span>,<span class="number">6</span>,<span class="number">7</span>,<span class="number">8</span>,<span class="number">9</span>];</span><br><span class="line"><span class="keyword">for</span>(<span class="keyword">let</span> num <span class="keyword">in</span> array){</span><br><span class="line">    <span class="built_in">console</span>.log(num);</span><br><span class="line">}</span><br></pre></td></tr></table></figure><p>&#x56E0;&#x4E3A;&#x4E4B;&#x524D;python&#x5199;&#x7684;&#x6BD4;&#x8F83;&#x591A;&#xFF0C;&#x6240;&#x4EE5;&#x672C;&#x6765;&#x5BF9;for in&#x8FD8;&#x662F;&#x5F88;&#x6709;&#x597D;&#x611F;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x6700;&#x5F00;&#x59CB;&#x5C31;&#x662F;&#x7528;&#x7684;for in&#x5BF9;&#x6570;&#x7EC4;&#x8FDB;&#x884C;&#x7684;&#x904D;&#x5386;&#x3002;&#x4F46;&#x662F;&#x5F53;&#x6211;&#x5728;&#x4F7F;&#x7528;for in&#x904D;&#x5386;&#x4E00;&#x4E2A;&#x957F;&#x5EA6;&#x4E3A;500&#x7684;&#x4E8C;&#x7EF4;&#x6570;&#x7EC4;&#x65F6;&#xFF0C;&#x5728;&#x6570;&#x7EC4;&#x7684;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x4F4D;&#x7F6E;&#x5E76;&#x6CA1;&#x6709;&#x5F97;&#x5230;&#x6B63;&#x786E;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x800C;&#x662F;&#x4E00;&#x4E2A;undefined&#xFF0C;&#x5373;array[499] = undefined&#xFF0C;&#x8FD9;&#x4E2A;bug&#x8BA9;&#x6211;&#x627E;&#x4E86;&#x5F88;&#x4E45;&#xFF0C;&#x4E5F;&#x662F;&#x6211;&#x9047;&#x5230;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x4E0D;&#x662F;&#x6211;&#x81EA;&#x5DF1;&#x9020;&#x6210;&#x7684;&#x5751;(&#xFF03;&#xFF40;&#x434;&#xB4;)&#xFF89;&#xFF0C;&#x7136;&#x800C;&#x4EE4;&#x6211;&#x6CA1;&#x60F3;&#x5230;&#x7684;&#x662F;js&#x7684;&#x904D;&#x5386;&#x8FD8;&#x6709;&#x66F4;&#x591A;&#x7684;&#x5751;&#x3002;</p><h2 id="3-for-of"><a href="#3-for-of" class="headerlink" title="3.for of"></a>3.for of</h2><p>ES6&#x4E2D;&#x5F15;&#x5165;&#x4E86; for &#x2026; of &#x5FAA;&#x73AF;&#xFF0C;&#x4EE5;&#x66FF;&#x4EE3; for&#x2026;in &#x548C; forEach() &#xFF0C;&#x5141;&#x8BB8;&#x5BF9; Array(&#x6570;&#x7EC4;)&#x3001;String(&#x5B57;&#x7B26;&#x4E32;)&#x3001;Maps(&#x6620;&#x5C04;)&#x3001;Sets(&#x96C6;&#x5408;)&#x7B49;&#x53EF;&#x8FED;&#x4EE3;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x8FDB;&#x884C;&#x904D;&#x5386;&#x3002;</p><figure class="highlight javascript"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">var</span> array = [<span class="number">1</span>,<span class="number">2</span>,<span class="number">3</span>,<span class="number">4</span>,<span class="number">5</span>,<span class="number">6</span>,<span class="number">7</span>,<span class="number">8</span>,<span class="number">9</span>];</span><br><span class="line"><span class="keyword">for</span>(<span class="keyword">let</span> num <span class="keyword">of</span> array){</span><br><span class="line">    <span class="built_in">console</span>.log(num);</span><br><span class="line">}</span><br></pre></td></tr></table></figure><p>for of&#x662F;&#x6211;&#x5728;&#x53D1;&#x73B0;for in&#x7684;bug&#x4E4B;&#x540E;&#x7528;&#x6765;&#x4EE3;&#x66FF;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x5728;&#x4F7F;&#x7528;&#x5176;&#x904D;&#x5386;&#x4E00;&#x4E2A;&#x5B57;&#x5178;&#x7684;values&#x65F6;&#x51FA;&#x73B0;&#x4E86;&#x95EE;&#x9898;&#xFF0C;&#x5F53;&#x65F6;&#x7684;&#x4EE3;&#x7801;&#x7C7B;&#x4F3C;&#x4E8E;&#x4E0B;&#x9762;&#x3002;</p><figure class="highlight javascript"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">var</span> array = [{<span class="number">1</span>:<span class="number">1</span>,<span class="number">2</span>:<span class="number">2</span>},{<span class="number">1</span>:<span class="number">2</span>,<span class="number">2</span>:<span class="number">3</span>},{<span class="number">1</span>:<span class="number">3</span>,<span class="number">2</span>:<span class="number">4</span>}];</span><br><span class="line"><span class="keyword">for</span>(<span class="keyword">let</span> dict <span class="keyword">of</span> <span class="built_in">Object</span>.values(array)){</span><br><span class="line">    (<span class="function"><span class="keyword">function</span>(<span class="params">dict</span>))</span>{</span><br><span class="line">     <span class="built_in">console</span>.log(dict[<span class="number">1</span>],,dict[<span class="number">2</span>]);</span><br><span class="line">    }(dict)</span><br><span class="line">}</span><br></pre></td></tr></table></figure><p>&#x7ED3;&#x679C;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x5982;&#x4E0B;</p><figure class="highlight lsl"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br></pre></td><td class="code"><pre><span class="line">undefined <span class="number">2</span></span><br><span class="line"><span class="number">2</span> <span class="number">3</span></span><br><span class="line"><span class="number">3</span> <span class="number">4</span></span><br></pre></td></tr></table></figure><p>&#x53C8;&#x662F;undefined&#xFF0C;&#x771F;&#x662F;&#x4EE4;&#x4EBA;&#x65E0;&#x8BED;&#xFF0C;&#x5F88;&#x8FF7;&#xFF0C;&#x5B8C;&#x5168;&#x627E;&#x4E0D;&#x5230;&#x7406;&#x7531;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x5C06;&#x5176;&#x6539;&#x6210;&#x4E86;for&#x5FAA;&#x73AF;&#x3002;&#x5F85;&#x4EE5;&#x540E;&#x627E;&#x5230;&#x539F;&#x56E0;&#x518D;&#x8BF4;&#x5427;&#xFF0C;&#x73B0;&#x5728;&#x5BF9;js&#x8FD9;&#x79CD;&#x52A8;&#x6001;&#x8BED;&#x8A00;&#x7684;&#x597D;&#x611F;&#x8D8A;&#x6765;&#x8D8A;&#x4F4E;&#x4E86;&#xFF0C;&#x4EE5;&#x540E;&#x8981;&#x662F;&#x518D;&#x7B80;&#x5355;&#x7684;&#x540E;&#x7AEF;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x8FD8;&#x662F;&#x7528;flask&#x5427;&#xFF0C;js&#x771F;&#x662F;&#x4E00;&#x8A00;&#x96BE;&#x5C3D;&#x554A;&#xFF0C;&#x96BE;&#x602A;&#x6CA1;&#x4EC0;&#x4E48;&#x4EBA;&#x7528;&#x5B83;&#x505A;&#x540E;&#x7AEF;&#x6846;&#x67B6;&#xFF0C;&#x800C;&#x662F;&#x7528;&#x5728;&#x524D;&#x7AEF;&#x4E0A;&#x3002;</p><h2 id="4-for-each"><a href="#4-for-each" class="headerlink" title="4.for each"></a>4.for each</h2><p>forEach() &#x65B9;&#x6CD5;&#x7528;&#x4E8E;&#x8C03;&#x7528;&#x6570;&#x7EC4;&#x7684;&#x6BCF;&#x4E2A;&#x5143;&#x7D20;&#xFF0C;&#x5E76;&#x5C06;&#x5143;&#x7D20;&#x4F20;&#x9012;&#x7ED9;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x3002;<br><figure class="highlight javascript"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">var</span> array = [<span class="number">1</span>,<span class="number">2</span>,<span class="number">3</span>,<span class="number">4</span>,<span class="number">5</span>,<span class="number">6</span>,<span class="number">7</span>,<span class="number">8</span>,<span class="number">9</span>];</span><br><span class="line">array.forEach(<span class="function"><span class="keyword">function</span>(<span class="params">num</span>)</span>{</span><br><span class="line">    <span class="built_in">console</span>.log(num);</span><br><span class="line">});</span><br></pre></td></tr></table></figure></p><p>&#x76EE;&#x524D;&#x6765;&#x8BF4;forEach()&#x8FD8;&#x6CA1;&#x6709;&#x53D1;&#x73B0;&#x4EC0;&#x4E48;&#x522B;&#x7684;&#x5751;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x591A;&#x4E0D;&#x8BF4;&#x56DE;&#x8C03;&#x8FD9;&#x4E2A;&#x4E1C;&#x897F;&#x633A;&#x90A3;&#x4E2A;&#x7684;&#xFF0C;&#x5199;&#x7684;&#x65F6;&#x5019;&#x8FD8;&#x8981;&#x8003;&#x8651;&#x662F;&#x4E0D;&#x662F;&#x5176;&#x4ED6;&#x90E8;&#x5206;&#x7684;&#x4EE3;&#x7801;&#x5BF9;&#x904D;&#x5386;&#x7ED3;&#x679C;&#x662F;&#x4E0D;&#x662F;&#x7ACB;&#x5373;&#x9700;&#x8981;&#xFF0C;&#x53CD;&#x6B63;&#x8BB0;&#x4F4F;&#x56DE;&#x8C03;&#x91CC;&#x7684;&#x4EE3;&#x7801;&#x4F1A;&#x8FDF;&#x4E8E;&#x5916;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x8FD0;&#x884C;&#x5C31;&#x884C;&#x4E86;&#x3002;</p><p>&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#xFF0C;js&#x6211;&#x53EA;&#x7528;&#x5230;&#x8FC7;&#x4E0A;&#x8FF0;&#x7684;&#x51E0;&#x79CD;&#x904D;&#x5386;&#x65B9;&#x5F0F;&#xFF0C;&#x611F;&#x89C9;js&#x771F;&#x7684;&#x6709;&#x5F88;&#x591A;&#x7684;&#x5751;&#xFF0C;&#x7B49;&#x4EE5;&#x540E;&#x9047;&#x5230;js&#x7684;&#x5176;&#x4ED6;&#x5751;&#xFF0C;&#x6211;&#x518D;&#x7EE7;&#x7EED;&#x8BB0;&#x5F55;&#x5427;&#x3002;</p>]]></content>
    
    <summary type="html">
    
      
      
        &lt;p&gt;&amp;#x4E4B;&amp;#x524D;&amp;#x5728;&amp;#x5199;&amp;#x7528;nodejs&amp;#x6784;&amp;#x5EFA;&amp;#x7684;&amp;#x7F51;&amp;#x7AD9;&amp;#x540E;&amp;#x7AEF;&amp;#x65F6;&amp;#xFF0C;&amp;#x7406;&amp;#x6240;&amp;#x
      
    
    </summary>
    
    
    
      <category term="JavaScript" scheme="http://infinitymiao.cn/tags/JavaScript/"/>
    
      <category term="nodejs" scheme="http://infinitymiao.cn/tags/nodejs/"/>
    
  </entry>
  
  <entry>
    <title>Hello World</title>
    <link href="http://infinitymiao.cn/2019/10/18/hello-world/"/>
    <id>http://infinitymiao.cn/2019/10/18/hello-world/</id>
    <published>2019-10-17T16:28:36.770Z</published>
    <updated>2019-10-28T03:56:51.822Z</updated>
    
    <content type="html"><![CDATA[<p>Welcome to <a href="https://hexo.io/" target="_blank" rel="noopener">Hexo</a>! This is your very first post. Check <a href="https://hexo.io/docs/" target="_blank" rel="noopener">documentation</a> for more info. If you get any problems when using Hexo, you can find the answer in <a href="https://hexo.io/docs/troubleshooting.html" target="_blank" rel="noopener">troubleshooting</a> or you can ask me on <a href="https://github.com/hexojs/hexo/issues" target="_blank" rel="noopener">GitHub</a>.</p><h2 id="Quick-Start"><a href="#Quick-Start" class="headerlink" title="Quick Start"></a>Quick Start</h2><h3 id="Create-a-new-post"><a href="#Create-a-new-post" class="headerlink" title="Create a new post"></a>Create a new post</h3><figure class="highlight bash"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">$ hexo new <span class="string">&quot;My New Post&quot;</span></span><br></pre></td></tr></table></figure><p>More info: <a href="https://hexo.io/docs/writing.html" target="_blank" rel="noopener">Writing</a></p><h3 id="Run-server"><a href="#Run-server" class="headerlink" title="Run server"></a>Run server</h3><figure class="highlight bash"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">$ hexo server</span><br></pre></td></tr></table></figure><p>More info: <a href="https://hexo.io/docs/server.html" target="_blank" rel="noopener">Server</a></p><h3 id="Generate-static-files"><a href="#Generate-static-files" class="headerlink" title="Generate static files"></a>Generate static files</h3><figure class="highlight bash"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">$ hexo generate</span><br></pre></td></tr></table></figure><p>More info: <a href="https://hexo.io/docs/generating.html" target="_blank" rel="noopener">Generating</a></p><h3 id="Deploy-to-remote-sites"><a href="#Deploy-to-remote-sites" class="headerlink" title="Deploy to remote sites"></a>Deploy to remote sites</h3><figure class="highlight bash"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">$ hexo deploy</span><br></pre></td></tr></table></figure><p>More info: <a href="https://hexo.io/docs/deployment.html" target="_blank" rel="noopener">Deployment</a></p>]]></content>
    
    <summary type="html">
    
      
      
        &lt;p&gt;Welcome to &lt;a href=&quot;https://hexo.io/&quot; target=&quot;_blank&quot; rel=&quot;noopener&quot;&gt;Hexo&lt;/a&gt;! This is your very first post. Check &lt;a href=&quot;https://hexo.
      
    
    </summary>
    
    
    
  </entry>
  
  <entry>
    <title>使用 Node.js 打造多用户实时监控系统</title>
    <link href="http://infinitymiao.cn/2018/10/21/%E4%BD%BF%E7%94%A8%20Node.js%20%E6%89%93%E9%80%A0%E5%A4%9A%E7%94%A8%E6%88%B7%E5%AE%9E%E6%97%B6%E7%9B%91%E6%8E%A7%E7%B3%BB%E7%BB%9F/"/>
    <id>http://infinitymiao.cn/2018/10/21/使用 Node.js 打造多用户实时监控系统/</id>
    <published>2018-10-21T09:15:38.000Z</published>
    <updated>2019-10-18T15:08:50.936Z</updated>
    
    <content type="html"><![CDATA[<h3 id="&#x80CC;&#x666F;&#x6982;&#x8FF0;"><a href="#&#x80CC;&#x666F;&#x6982;&#x8FF0;" class="headerlink" title="&#x80CC;&#x666F;&#x6982;&#x8FF0;"></a>&#x80CC;&#x666F;&#x6982;&#x8FF0;</h3><p>&#x9996;&#x5148;&#x63CF;&#x8FF0;&#x4E00;&#x4E0B;&#x7B14;&#x8005;&#x9047;&#x5230;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8BBE;&#x5B9A;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x573A;&#x666F;&#xFF1A;&#x73B0;&#x5728;&#x6709;&#x4E00;&#x4E2A;&#x5B9E;&#x65F6;&#x76D1;&#x63A7;&#x7CFB;&#x7EDF;&#x7684;&#x5F00;&#x53D1;&#x9700;&#x6C42;&#xFF0C;&#x8981;&#x6C42;&#x540C;&#x65F6;&#x652F;&#x6301;&#x591A;&#x4E2A;&#x7528;&#x6237;&#xFF08;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x4E3A;&#x4E86;&#x7B80;&#x5316;&#xFF0C;&#x6682;&#x65F6;&#x4E0D;&#x6D89;&#x53CA;&#x767B;&#x9646;&#x6001;&#xFF0C;&#x5047;&#x5B9A;&#x4E00;&#x4E2A;&#x8BBE;&#x5907;&#x5373;&#x4E3A;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#xFF09;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E0D;&#x540C;&#x7684;&#x7528;&#x6237;&#x6765;&#x8BB2;&#xFF0C;&#x4ED6;&#x4EEC;&#x9700;&#x8981;&#x76D1;&#x63A7;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#x662F;&#x5B8C;&#x5168;&#x76F8;&#x540C;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x8BBE;&#x5907;&#x7684; CPU &#x4FE1;&#x606F;&#x3001;&#x5185;&#x5B58;&#x4FE1;&#x606F;&#x7B49;&#xFF0C;&#x800C;&#x53E6;&#x5916;&#x4E00;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#x662F;&#x90E8;&#x5206;&#x7528;&#x6237;&#x91CD;&#x53E0;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x5BF9;&#x67D0;&#x4E00;&#x533A;&#x57DF;&#x7684;&#x7528;&#x6237;&#x6765;&#x8BF4;&#x67D0;&#x4E9B;&#x76D1;&#x63A7;&#x4FE1;&#x606F;&#x662F;&#x76F8;&#x540C;&#x7684;&#xFF0C;&#x800C;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x4FE1;&#x606F;&#xFF0C;&#x5219;&#x662F;&#x7528;&#x6237;&#x4E4B;&#x95F4;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#x7684;&#x3002;</p><p>&#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A;&#x7528;&#x6237;&#x6765;&#x8BB2;&#xFF0C;&#x5F53;&#x5176;&#x8FDB;&#x5165;&#x9875;&#x9762;&#x4E4B;&#x540E;&#x5373;&#x8868;&#x660E;&#x5176;&#x5F00;&#x59CB;&#x76D1;&#x63A7;&#xFF0C;&#x9700;&#x8981;&#x6301;&#x7EED;&#x5730;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x66F4;&#x65B0;&#xFF0C;&#x800C;&#x5F53;&#x5176;&#x9000;&#x51FA;&#x754C;&#x9762;&#x6216;&#x8005;&#x624B;&#x52A8;&#x70B9;&#x51FB;&#x505C;&#x6B62;&#x76D1;&#x63A7;&#xFF0C;&#x5219;&#x505C;&#x6B62;&#x76D1;&#x63A7;&#x3002;</p><h3 id="&#x95EE;&#x9898;&#x63CF;&#x8FF0;"><a href="#&#x95EE;&#x9898;&#x63CF;&#x8FF0;" class="headerlink" title="&#x95EE;&#x9898;&#x63CF;&#x8FF0;"></a>&#x95EE;&#x9898;&#x63CF;&#x8FF0;</h3><p>&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x5BF9;&#x4E8E;&#x4EE5;&#x4E0A;&#x60C5;&#x51B5;&#xFF0C;&#x6211;&#x4EEC;&#x5F88;&#x5BB9;&#x6613;&#x60F3;&#x5230;&#x901A;&#x8FC7; WebSocket&#xFF0C;&#x5BF9;&#x4E0D;&#x540C;&#x7684;&#x7528;&#x6237;&#x8FDB;&#x884C;&#x9694;&#x79BB;&#x5904;&#x7406;&#xFF0C;&#x5F53;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x5F00;&#x59CB;&#x76D1;&#x63A7;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x901A;&#x8FC7;&#x51FD;&#x6570;&#x6765;&#x9010;&#x4E2A;&#x542F;&#x52A8;&#x5176;&#x6240;&#x6709;&#x7684;&#x76D1;&#x63A7;&#x9879;&#x76EE;&#xFF0C;&#x5F53;&#x5176;&#x505C;&#x6B62;&#x76D1;&#x63A7;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53D6;&#x6D88;&#x76F8;&#x5173;&#x76D1;&#x63A7;&#xFF0C;&#x5E76;&#x4E14;&#x6E05;&#x9664;&#x65E0;&#x5173;&#x53D8;&#x91CF;&#x7B49;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;&#x6240;&#x6709;&#x5185;&#x5BB9;&#x5199;&#x5230; WebSocket &#x7684;&#x8FDE;&#x63A5;&#x56DE;&#x8C03;&#x4E2D;&#xFF0C;&#x7531;&#x4E8E;&#x4F5C;&#x7528;&#x57DF;&#x9694;&#x79BB;&#xFF0C;&#x4E0D;&#x540C;&#x7528;&#x6237;&#x4E4B;&#x95F4;&#x7684;&#x76D1;&#x63A7;&#xFF08;&#x8BFB;&#x64CD;&#x4F5C;&#xFF09;&#x4E0D;&#x4F1A;&#x4EA7;&#x751F;&#x4E92;&#x76F8;&#x5F71;&#x54CD;&#x3002;</p><p>&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x6700;&#x4E3A;&#x5FEB;&#x6377;&#x65B9;&#x4FBF;&#x7684;&#x65B9;&#x5F0F;&#x4E86;&#xFF0C;&#x5E76;&#x4E14;&#x51E0;&#x4E4E;&#x65E0;&#x9700;&#x8FDB;&#x884C;&#x8BBE;&#x8BA1;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x6837;&#x6709;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x660E;&#x663E;&#x7684;&#x6548;&#x7387;&#x95EE;&#x9898;&#xFF1A;</p><p>&#x7531;&#x4E8E;&#x4E0D;&#x540C;&#x7528;&#x6237;&#x7684;&#x90E8;&#x5206;&#x76D1;&#x63A7;&#x9879;&#x76EE;&#x662F;&#x6709;&#x91CD;&#x53E0;&#x7684;&#xFF0C;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E9B;&#x91CD;&#x53E0;&#x7684;&#x9879;&#x76EE;&#xFF0C;&#x6211;&#x4EEC;&#x5982;&#x679C;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x90FD;&#x5355;&#x72EC;&#x76D1;&#x63A7;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x4F1A;&#x4EA7;&#x751F;&#x975E;&#x5E38;&#x591A;&#x7684;&#x6D6A;&#x8D39;&#xFF0C;&#x5982;&#x679C;&#x8FD9;&#x4E9B;&#x76D1;&#x63A7;&#x4E2D;&#x8FD8;&#x6D89;&#x53CA;&#x5230;&#x6570;&#x636E;&#x5E93;&#x4EA4;&#x4E92;&#x6216;&#x8005;&#x8F83;&#x4E3A;&#x590D;&#x6742;&#x7684;&#x8BA1;&#x7B97;&#xFF0C;&#x90A3;&#x4E48;&#x6210;&#x500D;&#x4E4B;&#x540E;&#x7684;&#x6027;&#x80FD;&#x635F;&#x5931;&#x662F;&#x975E;&#x5E38;&#x96BE;&#x4EE5;&#x627F;&#x53D7;&#x7684;&#x3002;</p><p>&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5C06;&#x4E0D;&#x540C;&#x7528;&#x6237;&#x91CD;&#x53E0;&#x7684;&#x90A3;&#x4E9B;&#x76D1;&#x63A7;&#x9879;&#x76EE;&#xFF0C;&#x8FDB;&#x884C;&#x5408;&#x5E76;&#xFF0C;&#x5408;&#x5E76;&#x6210;&#x4E00;&#x4E2A;&#x4E4B;&#x540E;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x65B0;&#x7684;&#x6D88;&#x606F;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x63A8;&#x5230;&#x6240;&#x6709;&#x76F8;&#x5173;&#x7528;&#x6237;&#x7684;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x4E2D;&#x53BB;&#x5904;&#x7406;&#x3002;</p><p>&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x7BA1;&#x7406;&#x4E00;&#x4E2A;&#x4E00;&#x5BF9;&#x591A;&#x7684;&#x8BA2;&#x9605;&#x53D1;&#x5E03;&#x6A21;&#x5F0F;&#x3002;</p><p>&#x5230;&#x8FD9;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x5B9E;&#x73B0;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x76D1;&#x63A7;&#x7CFB;&#x7EDF;&#xFF0C;&#x5E76;&#x4E0D;&#x662F;&#x975E;&#x5E38;&#x7B80;&#x5355;&#xFF0C;&#x4E3B;&#x8981;&#x6709;&#x4E0B;&#x5217;&#x95EE;&#x9898;&#xFF1A;</p><ul><li>[1]&#x5BF9;&#x4E8E;&#x53EF;&#x80FD;&#x6709;&#x7528;&#x6237;&#x91CD;&#x53E0;&#x7684;&#x76D1;&#x63A7;&#x9879;&#x76EE;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x62BD;&#x79BB;&#x5230;&#x7528;&#x6237;&#x4F5C;&#x7528;&#x57DF;&#x4E4B;&#x5916;&#xFF0C;&#x5E76;&#x4E14;&#x901A;&#x8FC7;&#x7EDF;&#x8BA1;&#x8BA1;&#x6570;&#x7B49;&#x65B9;&#x5F0F;&#x6765;&#x201D;&#x8BB0;&#x4F4F;&#x201D;&#x5F53;&#x524D;&#x6240;&#x6709;&#x7684;&#x76D1;&#x63A7;&#x7528;&#x6237;&#xFF0C;&#x5F53;&#x6709;&#x65B0;&#x5185;&#x5BB9;&#x65F6;&#x63A8;&#x5230;&#x5404;&#x4E2A;&#x7528;&#x6237;&#x7684;&#x5904;&#x7406;&#x51FD;&#x6570;&#x4E2D;&#xFF0C;&#x5E76;&#x4E14;&#x5F53;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x53D6;&#x6D88;&#x76D1;&#x63A7;&#x7684;&#x65F6;&#x5019;&#x8981;&#x53CA;&#x65F6;&#x6E05;&#x7406;&#x76F8;&#x5173;&#x5BF9;&#x8C61;&#x3002;</li><li>[2]&#x4E0D;&#x540C;&#x7528;&#x6237;&#x7684;&#x91CD;&#x53E0;&#x76D1;&#x63A7;&#x9879;&#x76EE;&#x7684;&#x76D1;&#x63A7;&#x65B9;&#x5F0F;&#x4E5F;&#x5404;&#x4E0D;&#x76F8;&#x540C;&#xFF0C;&#x6709;&#x7684;&#x662F;&#x901A;&#x8FC7; <code>setInterval</code> &#x7B49;&#x65B9;&#x5F0F;&#x7684;&#x5B9A;&#x65F6;&#x4EFB;&#x52A1;&#xFF0C;&#x6709;&#x7684;&#x662F;&#x4E8B;&#x4EF6;&#x76D1;&#x542C;&#x5668;&#x7B49;&#x7B49;&#x3002;</li><li>[3]&#x5224;&#x65AD;&#x4E0D;&#x540C;&#x7528;&#x6237;&#x7684;&#x9879;&#x76EE;&#x662F;&#x5426;&#x91CD;&#x53E0;&#x4E5F;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x4E89;&#x8BAE;&#xFF0C;&#x6BD4;&#x5982;&#x5047;&#x8BBE;&#x4E0D;&#x540C;&#x7528;&#x6237;&#x7AEF;&#x76D1;&#x63A7;&#x7684;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#xFF0C;&#x8C03;&#x7528;&#x7684;&#x4E5F;&#x662F;&#x76F8;&#x540C;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x4F46;&#x662F;&#x7531;&#x4E8E;&#x7528;&#x6237; ID &#x4E0D;&#x540C;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x5982;&#x4F55;&#x5224;&#x65AD;&#x662F;&#x5426;&#x7B97;&#x201D;&#x540C;&#x4E00;&#x4E2A;&#x76D1;&#x63A7;&#x201D;&#xFF1F;</li></ul><p>&#x4EE5;&#x4E0A;&#x7684;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x4E0D;&#x501F;&#x52A9;&#x73B0;&#x6709;&#x7684;&#x5E93;&#x548C;&#x5DE5;&#x5177;&#xFF0C;&#x81EA;&#x5DF1;&#x987A;&#x7740;&#x601D;&#x8DEF;&#x4E00;&#x70B9;&#x70B9;&#x53BB;&#x5199;&#xFF0C;&#x5219;&#x5F88;&#x5BB9;&#x6613;&#x9677;&#x5165;&#x4FEE;&#x4FEE;&#x8865;&#x8865;&#x7684;&#x5FAA;&#x73AF;&#xFF0C;&#x65E0;&#x6CD5;&#x4E13;&#x6CE8;&#x76D1;&#x63A7;&#x672C;&#x8EAB;&#xFF0C;&#x5E76;&#x4E14;&#x6700;&#x540E;&#x751A;&#x81F3;&#x5728;&#x6548;&#x7387;&#x4E0A;&#x9002;&#x5F97;&#x5176;&#x53CD;&#x3002;</p><h3 id="&#x89E3;&#x51B3;&#x65B9;&#x6848;"><a href="#&#x89E3;&#x51B3;&#x65B9;&#x6848;" class="headerlink" title="&#x89E3;&#x51B3;&#x65B9;&#x6848;"></a>&#x89E3;&#x51B3;&#x65B9;&#x6848;</h3><p>&#x4EE5;&#x4E0B;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x57FA;&#x4E8E; Rx.js&#xFF0C;&#x9700;&#x8981;&#x5BF9; <a href="https://cn.rx.js.org/class/es6/Observable.js~Observable.html" target="_blank" rel="noopener">Observable</a> &#x6709;&#x4E00;&#x5B9A;&#x4E86;&#x89E3;&#x3002;</p><h4 id="&#x591A;&#x4E2A;&#x7528;&#x6237;&#x7684;&#x76D1;&#x63A7;&#x4EE5;&#x53CA;&#x53D6;&#x6D88;"><a href="#&#x591A;&#x4E2A;&#x7528;&#x6237;&#x7684;&#x76D1;&#x63A7;&#x4EE5;&#x53CA;&#x53D6;&#x6D88;" class="headerlink" title="&#x591A;&#x4E2A;&#x7528;&#x6237;&#x7684;&#x76D1;&#x63A7;&#x4EE5;&#x53CA;&#x53D6;&#x6D88;"></a>&#x591A;&#x4E2A;&#x7528;&#x6237;&#x7684;&#x76D1;&#x63A7;&#x4EE5;&#x53CA;&#x53D6;&#x6D88;</h4><p><a href="https://github.com/aircloud/monitor-rx" target="_blank" rel="noopener">Monitor-RX</a> &#x662F;&#x5BF9;&#x4EE5;&#x4E0A;&#x573A;&#x666F;&#x95EE;&#x9898;&#x7684;&#x4E00;&#x4E2A;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x5C01;&#x88C5;&#xFF0C;&#x5176;&#x5229;&#x7528;&#x4E86; Rx.js &#x5BF9;&#x8BA2;&#x9605;&#x53D1;&#x5E03;&#x7684;&#x7BA1;&#x7406;&#x80FD;&#x529B;&#xFF0C;&#x53EF;&#x4EE5;&#x8BA9;&#x6574;&#x4E2A;&#x6D41;&#x7A0B;&#x53D8;&#x7684;&#x6E05;&#x6670;&#x3002;</p><p>&#x5728; Rx.js &#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4EE5;&#x4E0B;&#x65B9;&#x5F0F;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x591A;&#x64AD;&#x5BF9;&#x8C61; <code>multicasted</code>&#xFF1A;</p><figure class="highlight smali"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br></pre></td><td class="code"><pre><span class="line">var source = Rx.from([1, 2, 3]);</span><br><span class="line">var subject =<span class="built_in"> new </span>Rx.Subject();</span><br><span class="line">var multicasted = source.pipe(multicast(subject)).refCount();</span><br><span class="line">// &#x5176;&#x5C5E;&#x4E8E;<span class="built_in"> monitor-rx </span>&#x7684;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;&#xFF0C;&#x65E0;&#x9700;&#x7406;&#x89E3;&#x4EA6;&#x53EF;&#x4F7F;&#x7528; monitor-rx</span><br><span class="line"></span><br><span class="line">subscription1 = refCounted.subscribe({</span><br><span class="line">    next: (v) =&gt; console.log(&apos;observerA: &apos; + JSON.stringify(v))</span><br><span class="line">});</span><br><span class="line"></span><br><span class="line">setTimeout(() =&gt; {</span><br><span class="line">    subscription2 = refCounted.subscribe({</span><br><span class="line">        next: (v) =&gt; console.log(&apos;observerB: &apos; + JSON.stringify(v))</span><br><span class="line">    });</span><br><span class="line">}, 1200);</span><br><span class="line"></span><br><span class="line">subscription1.unsubscribe();</span><br><span class="line">setTimeout(() =&gt; {</span><br><span class="line">    subscription2.unsubscribe();</span><br><span class="line">    // &#x8FD9;&#x91CC; refCounted &#x7684; unsubscribe &#x76F8;&#x5173;&#x6E05;&#x7406;&#x903B;&#x8F91;&#x4F1A;&#x81EA;&#x52A8;&#x88AB;&#x8C03;&#x7528;</span><br><span class="line">}, 3200);</span><br></pre></td></tr></table></figure><p>&#x5728;&#x8FD9;&#x91CC;&#x91C7;&#x7528;&#x591A;&#x64AD;&#xFF0C;&#x6709;&#x5982;&#x4E0B;&#x51E0;&#x4E2A;&#x597D;&#x5904;&#xFF1A;</p><ul><li>&#x53EF;&#x4EE5;&#x968F;&#x65F6;&#x589E;&#x52A0;&#x65B0;&#x7684;&#x8BA2;&#x9605;&#x8005;&#xFF0C;&#x5E76;&#x4E14;&#x65B0;&#x7684;&#x8BA2;&#x9605;&#x8005;&#x53EA;&#x4F1A;&#x6536;&#x5230;&#x5176;&#x52A0;&#x5165;&#x8BA2;&#x9605;&#x4E4B;&#x540E;&#x7684;&#x6570;&#x636E;&#x3002;</li><li>&#x53EF;&#x4EE5;&#x968F;&#x65F6;&#x5BF9;&#x4EFB;&#x610F;&#x4E00;&#x4E2A;&#x8BA2;&#x9605;&#x8005;&#x53D6;&#x6D88;&#x8BA2;&#x9605;&#x3002;</li><li>&#x5F53;&#x6240;&#x6709;&#x8BA2;&#x9605;&#x8005;&#x53D6;&#x6D88;&#x8BA2;&#x9605;&#x4E4B;&#x540E;&#xFF0C;Observable &#x4F1A;&#x81EA;&#x52A8;&#x89E6;&#x53D1; Observable &#x51FD;&#x6570;&#xFF0C;&#x4ECE;&#x800C;&#x53EF;&#x4EE5;&#x5BF9;&#x5176;&#x4E8B;&#x4EF6;&#x5FAA;&#x73AF;&#x7B49;&#x8FDB;&#x884C;&#x6E05;&#x7406;&#x3002;</li></ul><p>&#x4EE5;&#x4E0A;&#x80FD;&#x529B;&#x5176;&#x5B9E;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x89E3;&#x51B3;&#x4E0A;&#x6587;&#x63D0;&#x5230;&#x7684;&#x95EE;&#x9898; [1]&#x3002;</p><h4 id="&#x76D1;&#x63A7;&#x683C;&#x5F0F;&#x7684;&#x7EDF;&#x4E00;"><a href="#&#x76D1;&#x63A7;&#x683C;&#x5F0F;&#x7684;&#x7EDF;&#x4E00;" class="headerlink" title="&#x76D1;&#x63A7;&#x683C;&#x5F0F;&#x7684;&#x7EDF;&#x4E00;"></a>&#x76D1;&#x63A7;&#x683C;&#x5F0F;&#x7684;&#x7EDF;&#x4E00;</h4><p>&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x76D1;&#x63A7;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x4ECE;&#x6570;&#x636E;&#x4F9D;&#x8D56;&#x7684;&#x89D2;&#x5EA6;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x76D1;&#x63A7;&#x51FD;&#x6570;&#x4F1A;&#x6709;&#x8FD9;&#x6837;&#x51E0;&#x7C7B;&#xFF1A;</p><ul><li>[a]&#x7EAF;&#x7CB9;&#x7684;&#x5B9A;&#x65F6;&#x4EFB;&#x52A1;&#xFF0C;&#x65E0;&#x6570;&#x636E;&#x4F9D;&#x8D56;&#xFF0C;&#x8FD9;&#x65B9;&#x9762;&#x6BD4;&#x5982;&#x5F53;&#x524D;&#x5185;&#x5B58;&#x5FEB;&#x7167;&#x6570;&#x636E;&#x7B49;&#x3002;</li><li>[b]&#x5E26;&#x6709;&#x8BB0;&#x5FC6;&#x4F9D;&#x8D56;&#x7684;&#x5B9A;&#x65F6;&#x4EFB;&#x52A1;&#xFF1A;&#x5B9A;&#x65F6;&#x4EFB;&#x52A1;&#x4F9D;&#x8D56;&#x524D;&#x4E00;&#x6B21;&#x7684;&#x6570;&#x636E;&#xFF08;&#x751A;&#x81F3;&#x66F4;&#x591A;&#x6B21;&#xFF09;&#xFF0C;&#x9700;&#x8981;&#x4E24;&#x6B21;&#x6570;&#x636E;&#x505A;&#x5DEE;&#x7B49;&#xFF0C;&#x8FD9;&#x65B9;&#x9762;&#x7684;&#x6570;&#x636E;&#x6BD4;&#x5982;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x7684;&#x6D88;&#x8017;&#x6570;&#x636E;&#xFF0C;cpu &#x4F7F;&#x7528;&#x7387;&#x7684;&#x8BA1;&#x7B97;&#x3002;</li><li>[c]&#x5E26;&#x6709;&#x7528;&#x6237;&#x4F9D;&#x8D56;&#x7684;&#x5B9A;&#x65F6;&#x4EFB;&#x52A1;&#xFF1A;&#x4F9D;&#x8D56;&#x7528;&#x6237; id &#x7B49;&#x4FE1;&#x606F;&#xFF0C;&#x4E0D;&#x540C;&#x7528;&#x6237;&#x65E0;&#x6CD5;&#x5171;&#x7528;&#x3002;</li></ul><p>&#x800C;&#x4ECE;&#x4EFB;&#x52A1;&#x89E6;&#x53D1;&#x7684;&#x89D2;&#x5EA6;&#xFF0C;&#x6211;&#x4EEC;&#x4ECD;&#x5F85;&#x53EF;&#x4EE5;&#x5BF9;&#x5176;&#x5206;&#x7C7B;&#xFF1A;</p><ul><li>[i]&#x7B80;&#x5355;&#x7684; <code>setInterval</code> &#x5B9A;&#x65F6;&#x4EFB;&#x52A1;&#x3002;</li><li>[ii]&#x57FA;&#x4E8E;&#x4E8B;&#x4EF6;&#x673A;&#x5236;&#x7684;&#x4E0D;&#x5B9A;&#x65F6;&#x4EFB;&#x52A1;&#x3002;</li><li>[iii]&#x57FA;&#x4E8E;&#x5176;&#x4ED6;&#x89E6;&#x53D1;&#x673A;&#x5236;&#x7684;&#x4EFB;&#x52A1;&#x3002;</li></ul><p>&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x6211;&#x4EEC;&#x5982;&#x679C;&#x91C7;&#x7528; Rx.js &#x7684;&#x6A21;&#x5F0F;&#x8FDB;&#x884C;&#x7F16;&#x5199;&#xFF0C;&#x65E0;&#x9700;&#x8003;&#x8651;&#x4EFB;&#x52A1;&#x7684;&#x6570;&#x636E;&#x4F9D;&#x8D56;&#x548C;&#x89E6;&#x53D1;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x53EA;&#x9700;&#x5199;&#x6210;&#x4E00;&#x4E2A;&#x4E00;&#x4E2A; Observable &#x5B9E;&#x4F8B;&#x5373;&#x53EF;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x5BF9;&#x4E8E;&#x6BD4;&#x8F83;&#x7B80;&#x5355;&#x7684; [a]&amp;[i] &#x6216; [c]&amp;[i]  &#x7C7B;&#x578B;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x53EF;&#x4EE5;&#x901A;&#x8FC7; monitor-rx &#x63D0;&#x4F9B;&#x7684; <code>convertToRx</code> &#x6216; <code>convertToSimpleRx</code> &#x8F6C;&#x6362;&#x6210; Observable &#x5B9E;&#x4F8B;&#x751F;&#x6210;&#x51FD;&#x6570;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;</p><figure class="highlight javascript"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">var</span> os = <span class="built_in">require</span>(<span class="string">&apos;os&apos;</span>);</span><br><span class="line"><span class="keyword">var</span> process = <span class="built_in">require</span>(<span class="string">&apos;process&apos;</span>);</span><br><span class="line"><span class="keyword">const</span> monitorRx = <span class="built_in">require</span>(<span class="string">&apos;monitor-rx&apos;</span>);</span><br><span class="line"></span><br><span class="line"><span class="function"><span class="keyword">function</span> <span class="title">getMemoryInfo</span>(<span class="params"></span>) </span>{</span><br><span class="line">    <span class="keyword">return</span> process.memoryUsage();</span><br><span class="line">}</span><br><span class="line"></span><br><span class="line"><span class="keyword">const</span> memory = monitorRx.Utils.convertToSimpleRx(getMemoryInfo)</span><br><span class="line"></span><br><span class="line"><span class="comment">// &#x6216;&#x8005;</span></span><br><span class="line"><span class="comment">//const memory = monitorRx.Utils.convertToRx({</span></span><br><span class="line"><span class="comment">//    getMemoryInfo</span></span><br><span class="line"><span class="comment">//});</span></span><br><span class="line"></span><br><span class="line"><span class="built_in">module</span>.exports = memory;</span><br></pre></td></tr></table></figure><p>convertToRx &#x76F8;&#x6BD4;&#x4E8E; convertToSimpleRx&#xFF0C;&#x53EF;&#x4EE5;&#x652F;&#x6301;&#x51FD;&#x6570;&#x914D;&#x7F6E;&#x6CE8;&#x5165;&#xFF08;&#x5373;&#x4E0B;&#x6587;&#x4E2D; opts &#x7684; func &#x5C5E;&#x6027;&#x548C; args &#x5C5E;&#x6027;&#xFF09;,&#x53EF;&#x4EE5;&#x5728;&#x5177;&#x4F53;&#x751F;&#x6210; Observable &#x5B9E;&#x4F8B;&#x7684;&#x65F6;&#x5019;&#x5177;&#x4F53;&#x6307;&#x5B9A;&#x4F7F;&#x7528;&#x54EA;&#x4E9B;&#x51FD;&#x6570;&#x4EE5;&#x53CA;&#x5176;&#x53C2;&#x6570;&#x3002;</p><p>&#x5982;&#x679C;&#x662F;&#x6BD4;&#x8F83;&#x590D;&#x6742;&#x7684; Observable &#x7C7B;&#x578B;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x5C31;&#x65E0;&#x6CD5;&#x76F4;&#x63A5;&#x901A;&#x8FC7;&#x666E;&#x901A;&#x51FD;&#x6570;&#x8FDB;&#x884C;&#x8F6C;&#x5316;&#x4E86;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x9075;&#x5FAA; Observable &#x7684;&#x6807;&#x51C6;&#x8FD4;&#x56DE; Observable &#x751F;&#x6210;&#x51FD;&#x6570;&#x5373;&#x53EF;&#xFF08;&#x4E0D;&#x662F;&#x76F4;&#x63A5;&#x8FD4;&#x56DE; Observable &#x5B9E;&#x4F8B;&#xFF09; </p><p>&#x8FD9;&#x5B9E;&#x9645;&#x4E0A;&#x4E5F;&#x5BF9;&#x95EE;&#x9898; [2] &#x8FDB;&#x884C;&#x4E86;&#x89E3;&#x51B3;&#x3002;</p><h4 id="&#x76D1;&#x63A7;&#x552F;&#x4E00;&#x6027;&#xFF1A;"><a href="#&#x76D1;&#x63A7;&#x552F;&#x4E00;&#x6027;&#xFF1A;" class="headerlink" title="&#x76D1;&#x63A7;&#x552F;&#x4E00;&#x6027;&#xFF1A;"></a>&#x76D1;&#x63A7;&#x552F;&#x4E00;&#x6027;&#xFF1A;</h4><p>&#x6211;&#x4EEC;&#x77E5;&#x9053;&#xFF0C;&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x7528;&#x6237;&#x90FD;&#x76D1;&#x63A7;&#x540C;&#x4E00;&#x4E2A;&#x4FE1;&#x606F;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5171;&#x7528;&#x4E00;&#x4E2A; Observable&#xFF0C;&#x8FD9;&#x91CC;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5C31;&#x662F;&#x5982;&#x4F55;&#x5B9A;&#x4E49;&#x4E24;&#x4E2A;&#x7528;&#x6237;&#x7684;&#x76D1;&#x63A7;&#x662F;&#x201D;&#x76F8;&#x540C;&#x201D;&#x7684;&#x3002;</p><p>&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x91C7;&#x7528;&#x4E00;&#x4E2A;&#x53EF;&#x9009;&#x9879; opts &#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x5176;&#x4E00;&#x5171;&#x6709;&#x5982;&#x4E0B;&#x5C5E;&#x6027;&#xFF1A;</p><figure class="highlight less"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br></pre></td><td class="code"><pre><span class="line">{</span><br><span class="line">    <span class="attribute">module</span>: <span class="string">&apos;ModuleName&apos;</span>,</span><br><span class="line">    <span class="attribute">func</span>: [<span class="string">&apos;FuncName&apos;</span>],</span><br><span class="line">    <span class="attribute">args</span>: [[<span class="string">&apos;arg1&apos;</span>,<span class="string">&apos;arg2&apos;</span>]],</span><br><span class="line">    <span class="attribute">opts</span>: {<span class="attribute">interval</span>:<span class="number">1000</span>}, </span><br><span class="line">}</span><br></pre></td></tr></table></figure><p>module &#x5373;&#x7528;&#x6237;&#x662F;&#x5BF9;&#x54EA;&#x4E00;&#x4E2A;&#x6A21;&#x5757;&#x8FDB;&#x884C;&#x76D1;&#x63A7;&#xFF08;&#x5B9E;&#x9645;&#x4E0A;&#x662F; Observable&#xFF09;&#xFF0C;func &#x548C; args &#x5219;&#x662F;&#x76D1;&#x63A7;&#x8FC7;&#x7A0B;&#x4E2D;&#x9700;&#x8981;&#x8C03;&#x7528;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7; agrs &#x4F20;&#x5165;&#x7528;&#x6237;&#x4E2A;&#x4EBA;&#x4FE1;&#x606F;&#x3002;&#x4E8E;&#x6CA1;&#x6709;&#x5185;&#x90E8;&#x5B50;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x7684;&#x76D1;&#x63A7;&#xFF0C;&#x4E8C;&#x8005;&#x4E3A;&#x7A7A;&#x5373;&#x53EF;&#xFF0C;opts &#x662F;&#x4E00;&#x4E9B;&#x5176;&#x4ED6;&#x53EF;&#x9009;&#x9879;&#xFF0C;&#x6BD4;&#x5982;&#x5B9A;&#x4E49;&#x8BF7;&#x6C42;&#x95F4;&#x9694;&#x7B49;&#x3002;</p><p>&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x8FC7; <code>JSON.stringify(opts)</code> &#x6765;&#x5E8F;&#x5217;&#x5316;&#x8FD9;&#x4E2A;&#x53EF;&#x9009;&#x9879;&#x914D;&#x7F6E;&#xFF0C;&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x7528;&#x6237;&#x5E8F;&#x5217;&#x5316;&#x540E;&#x7684;&#x53EF;&#x9009;&#x9879;&#x914D;&#x7F6E;&#x76F8;&#x540C;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x5C31;&#x8BA4;&#x4E3A;&#x8FD9;&#x4E24;&#x4E2A;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x5171;&#x7528;&#x4E00;&#x4E2A;&#x76D1;&#x63A7;&#xFF0C;&#x5373;&#x5171;&#x7528;&#x4E00;&#x4E2A; Observable&#x3002;</p><h3 id="&#x66F4;&#x591A;&#x5185;&#x5BB9;"><a href="#&#x66F4;&#x591A;&#x5185;&#x5BB9;" class="headerlink" title="&#x66F4;&#x591A;&#x5185;&#x5BB9;"></a>&#x66F4;&#x591A;&#x5185;&#x5BB9;</h3><p>&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x501F;&#x52A9; Monitor-RX&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5F88;&#x65B9;&#x4FBF;&#x7684;&#x89E3;&#x51B3;&#x4E0A;&#x8FF0;&#x63D0;&#x51FA;&#x7684;&#x95EE;&#x9898;&#xFF0C;Monitor-RX &#x4E5F;&#x5728;&#x79EF;&#x6781;&#x7684;&#x66F4;&#x65B0;&#x4E2D;&#xFF0C;&#x5927;&#x5BB6;&#x53EF;&#x4EE5;&#x5728;<a href="https://github.com/aircloud/monitor-rx" target="_blank" rel="noopener">&#x8FD9;&#x91CC;</a>&#x4E86;&#x89E3;&#x5230;&#x66F4;&#x591A;&#x7684;&#x4FE1;&#x606F;&#x3002;</p>]]></content>
    
    <summary type="html">
    
      
      
        &lt;h3 id=&quot;&amp;#x80CC;&amp;#x666F;&amp;#x6982;&amp;#x8FF0;&quot;&gt;&lt;a href=&quot;#&amp;#x80CC;&amp;#x666F;&amp;#x6982;&amp;#x8FF0;&quot; class=&quot;headerlink&quot; title=&quot;&amp;#x80CC;&amp;#x666F;&amp;#x6982;&amp;#x8
      
    
    </summary>
    
    
    
      <category term="Node.js" scheme="http://infinitymiao.cn/tags/Node-js/"/>
    
      <category term="javascript" scheme="http://infinitymiao.cn/tags/javascript/"/>
    
      <category term="Rx.js" scheme="http://infinitymiao.cn/tags/Rx-js/"/>
    
  </entry>
  
</feed>
